zmzdh/CAN_st_test/Drivers/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fg0xxa.h
/**************************************************************************************************** * @file     FM33FG0XXA.h
 *
 * @brief    CMSIS CORTEX-M0 Peripheral Access Layer Header File for
 *           FM33FG0XXA from Keil.
 *
 * @version  V0.0.1
 * @date     21 march 2023
 *
 * @note     Generated with SVDConv V2.87e 
 *           from CMSIS SVD File 'FM33FG0XXA.SVD' Version 1.0,
 *
 * @par      ARM Limited (ARM) is supplying this software for use with Cortex-M
 *           processor based microcontroller, but can be equally used for other
 *           suitable processor architectures. This file can be freely distributed.
 *           Modifications to this file shall be clearly marked.
 *
 *           THIS SOFTWARE IS PROVIDED “AS IS”. NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 *           OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 *           MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 *           ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 *           CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 *******************************************************************************************************/


/** @addtogroup Keil
  * @{
  */

/** @addtogroup FM33FG0XXA
  * @{
  */

#ifndef FM33FG0XXA_H
#define FM33FG0XXA_H

#ifdef __cplusplus
extern "C" {
#endif

#define __RCHF_INITIAL_CLOCK        (8000000)        /* Value of the Internal RC HIGH oscillator in Hz */
#define __RCMF_CLOCK                (4000000)        /* Value of the Internal RC 4M oscillator in Hz */
#define __LPOSC_CLOCK               (32000)          /* Value of the Internal RC LOW oscillator in Hz */
#define __XTHF_CLOCK                (8000000)        /* Value of the EXTERNAL oscillator in Hz */
#define __XTLF_CLOCK                (32768)          /* Value of the EXTERNAL oscillator in Hz */

#define __LOT_ID0                   (*((unsigned char *)0x1FFFFA20))
#define __LOT_ID1                   (*((unsigned char *)0x1FFFFA21))
#define __LOT_ID2                   (*((unsigned char *)0x1FFFFA22))
#define __LOT_ID3                   (*((unsigned char *)0x1FFFFA23))
#define __LOT_ID4                   (*((unsigned char *)0x1FFFFA24))
#define __LOT_ID5                   (*((unsigned char *)0x1FFFFA25))
/* CHIP_U01: 68Z869   
             68Z92W   
             68Z934 */
#define CHIP_U01  (((__LOT_ID0==6)&&(__LOT_ID1==8)&&(__LOT_ID2==35)&&(__LOT_ID3==8)&&(__LOT_ID4==6)&&(__LOT_ID5==9 )) ||\
                   ((__LOT_ID0==6)&&(__LOT_ID1==8)&&(__LOT_ID2==35)&&(__LOT_ID3==9)&&(__LOT_ID4==2)&&(__LOT_ID5==32)) ||\
                   ((__LOT_ID0==6)&&(__LOT_ID1==8)&&(__LOT_ID2==35)&&(__LOT_ID3==9)&&(__LOT_ID4==3)&&(__LOT_ID5==4 )))

/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {

/* ------------------  FM33FG0XXA Processor Exceptions Numbers  ------------------*/
  Reset_IRQn                    = -15,              /*!<   1  复位向量 */
  NMI_IRQn                      = -14,              /*!<   2  WKUPx中断，PMU中断，存储器非法访问中断，Flash ECC检错中断，RAM ECC检错中断 */
  HardFault_IRQn                = -13,              /*!<   3  HardFault中断向量 */
  SVC_IRQn                      = -5,               /*!<  11  SVCall系统服务请求 */
  PendSV_IRQn                   = -2,               /*!<  14  可挂起系统服务请求 */
  SysTick_IRQn                  = -1,               /*!<  15  内部定时器中断向量 */

/* --------------------  Cortex-M0 Specific Interrupt Numbers  --------------------*/
  WDT_IRQn                      = 0,                /*!<   0  窗口看门狗或独立看门狗中断 */
  SVD_IRQn                      = 1,                /*!<   1  电源监测报警中断 */
  RTC_IRQn                      = 2,                /*!<   2  实时时钟中断 */
  CANFD0_IRQn                   = 3,                /*!<   3  CAN-FD中断（包含唤醒中断） */
  CANFD1_IRQn                   = 4,                /*!<   4  CAN-FD中断（包含唤醒中断） */
  ADC_IRQn                      = 5,                /*!<   5  ADC转换完成中断 */
  FSCAN_IRQn                    = 6,                /*!<   6  FSCAN中断 */
  UART0_IRQn                    = 7,                /*!<   7  UART中断 */
  UART1_IRQn                    = 8,                /*!<   8  UART中断 */
  UART2_IRQn                    = 9,                /*!<   9  UART中断 */
  UART3_IRQn                    = 10,               /*!<  10  UART中断 */
  UART4_UART5_IRQn              = 11,               /*!<  11  UART中断，USART中断 */
  I2CMX_IRQn                    = 12,               /*!<  12  I2C_masterx中断 */
  SPI0_IRQn                     = 13,               /*!<  13  SPI中断 */
  SPI1_IRQn                     = 14,               /*!<  14  SPI中断 */
  SPI2_IRQn                     = 15,               /*!<  15  SPI中断 */
  SPI3_IRQn                     = 16,               /*!<  16  SPI中断 */
  I2C_SMBX_IRQn                 = 17,               /*!<  17  I2C SMBUSx中断 */
  SENTX_IRQn                    = 18,               /*!<  18  SENTx中断 */
  AES_IRQn                      = 19,               /*!<  19  AES中断 */
  LPTIM_BSTIM_IRQn              = 20,               /*!<  20  LPTIM16中断，LPTIM32中断，BSTIM16中断， BSTIM32中断 */
  DMA_IRQn                      = 21,               /*!<  21  DMA中断 */
  WKUPX_IRQn                    = 22,               /*!<  22  WKUPx引脚中断 */
  TAU_PGL_IRQn                  = 23,               /*!<  23  TAU中断，PGL中断 */
  GPTIMX_IRQn                   = 24,               /*!<  24  GPTIMx中断 */
  COMPX_IRQn                    = 25,               /*!<  25  COMPx中断 */
  CLMX_IRQn                     = 26,               /*!<  26  CLMx时钟监控中断 */
  NVMIF_IRQn                    = 27,               /*!<  27  NVMIF中断 */
  ATIM_IRQn                     = 28,               /*!<  28  高级定时器中断 */
  LPUART_IRQn                   = 29,               /*!<  29  LPUART中断 */
  EXTI_DAC_IRQn                 = 30,               /*!<  30  外部引脚中断，DAC中断 */
  ECCC_RAMP_FDET_IRQn           = 31,               /*!<  31  Flash ECC纠错中断，RAM ECC纠错中断，XTLF或XTHF停振检测中断 */

} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the CORTEX-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0100            /*!< CORTEX-M0 Core Revision                                               */
#define __MPU_PRESENT                  1            /*!< MPU present or not                                                    */
#define __VTOR_PRESENT                 1            /*!< VTOR present or not                                                   */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                           /*!< Cortex-M0 processor and core peripherals */
#include "system_fm33fg0xxa.h"                      /*!< FM33FG0XXA System */

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */

/** @addtogroup Device_Peripheral_Registers
  * @{
  */

/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
#warning Not supported compiler type
#endif


/* ================================================================================ */
/* ================                       FLASH                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RDCR;                   /*!<  Flash Read Control Register,                          Address offset: 0x00 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x04 */
  __IO uint32_t OPTBR;                  /*!<  Flash Option Bytes Register,                          Address offset: 0x08 */
  __IO uint32_t RSV2[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x0C */
  __IO uint32_t CFLS_EPCR;              /*!<  Code Flash Erase/Program Control Register,            Address offset: 0x14 */
  __O  uint32_t CFLS_KEY;               /*!<  Code Flash Key Register,                              Address offset: 0x18 */
  __IO uint32_t CFLS_IER;               /*!<  Code Flash Interrupt Enable Register,                 Address offset: 0x1C */
  __IO uint32_t CFLS_ISR;               /*!<  Code Flash Interrupt Status Register,                 Address offset: 0x20 */
  __IO uint32_t RSV3;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t CFLS_ECCR;              /*!<  ,                                                     Address offset: 0x28 */
  __IO uint32_t DFLS_ECCR;              /*!<  ,                                                     Address offset: 0x2C */
  __IO uint32_t RAM_ECCR;               /*!<  ,                                                     Address offset: 0x30 */
  __IO uint32_t RSV4[7];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
  __IO uint32_t HSRAM1_CFGR;            /*!<  ,                                                     Address offset: 0x50 */
  __IO uint32_t HSRAM2_CFGR;            /*!<  ,                                                     Address offset: 0x54 */
  __IO uint32_t RSV5[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x58 */
  __IO uint32_t ACLOCK1;                /*!<  Flash Application Code Lock Register1,                Address offset: 0x60 */
  __IO uint32_t ACLOCK2;                /*!<  Flash Application Code Lock Register2,                Address offset: 0x64 */
  __IO uint32_t ACLOCK3;                /*!<  Flash Application Code Lock Register3,                Address offset: 0x68 */
  __IO uint32_t ACLOCK4;                /*!<  Flash Application Code Lock Register4,                Address offset: 0x6C */
  __IO uint32_t RSV6[8];                /*!<  RESERVED REGISTER,                                    Address offset: 0x70 */
  __IO uint32_t DFLS_EPCR;              /*!<  Data Flash Erase/Program Control Register,            Address offset: 0x90 */
  __O  uint32_t DFLS_KEY;               /*!<  Data Flash Key Register,                              Address offset: 0x94 */
  __IO uint32_t DFLS_IER;               /*!<  Data Flash Interrupt Enable Register,                 Address offset: 0x98 */
  __IO uint32_t DFLS_ISR;               /*!<  Data Flash Interrupt Status Register,                 Address offset: 0x9C */
  __IO uint32_t RSV7[24];               /*!<  RESERVED REGISTER,                                    Address offset: 0xA0 */
  __I  uint32_t RAM_RAW0;               /*!<  ,                                                     Address offset: 0x100 */
  __I  uint32_t RAM_RAW1;               /*!<  ,                                                     Address offset: 0x104 */
  __I  uint32_t DFLS_RAW0;              /*!<  ,                                                     Address offset: 0x108 */
  __I  uint32_t DFLS_RAW1;              /*!<  ,                                                     Address offset: 0x10C */
  __IO uint32_t RSV8[60];               /*!<  RESERVED REGISTER,                                    Address offset: 0x110 */
  __O  uint32_t BDVR;                   /*!<  ,                                                     Address offset: 0x200 */
  __IO uint32_t BDCR0;                  /*!<  ,                                                     Address offset: 0x204 */
  __IO uint32_t BDCR1;                  /*!<  ,                                                     Address offset: 0x208 */
  __I  uint32_t BDSR;                   /*!<  ,                                                     Address offset: 0x20C */
}FLASH_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  Power Management Control Register,                    Address offset: 0x00 */
  __IO uint32_t WKTR;                   /*!<  Wakeup Time Register,                                 Address offset: 0x04 */
  __IO uint32_t WKFR;                   /*!<  Wakeup Source Flags Register,                         Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  PMU Interrupt Enable Register,                        Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  PMU Interrupt and Status Register,                    Address offset: 0x10 */
  __IO uint32_t RSV1[10];               /*!<  RESERVED REGISTER,                                    Address offset: 0x14 */
  __IO uint32_t BUFCR;                  /*!<  PMU Analog Buffer Control Register,                   Address offset: 0x3C */
  __IO uint32_t RSV2[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x40 */
  __IO uint32_t PTAT_CR;                /*!<  PMU PTAT Control Register,                            Address offset: 0x50 */
  __IO uint32_t RSV3[11];               /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
  __IO uint32_t CFDCK_CR;               /*!<  ,                                                     Address offset: 0x80 */
  __IO uint32_t CFDCK_SR;               /*!<  ,                                                     Address offset: 0x84 */
}PMU_Type;


/* ================================================================================ */
/* ================                       SCU                      ================ */
/* ================================================================================ */

typedef struct
{
  __I  uint32_t SYSCON;                 /*!<  Memory Capacity Query Register,                       Address offset: 0x00 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x04 */
  __IO uint32_t HDFFLAG;                /*!<  Hardfault Query Register,                             Address offset: 0x08 */
}SCU_Type;


/* ================================================================================ */
/* ================                       RMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t PDRCR;                  /*!<  PDR Control Register,                                 Address offset: 0x00 */
  __IO uint32_t BORCR;                  /*!<  BOR Control Register,                                 Address offset: 0x04 */
  __IO uint32_t LKPCR;                  /*!<  Reset Config Register,                                Address offset: 0x08 */
  __O  uint32_t SOFTRST;                /*!<  Software Reset Register,                              Address offset: 0x0C */
  __IO uint32_t RSTFR;                  /*!<  Reset Flag Register,                                  Address offset: 0x10 */
  __O  uint32_t PRSTEN;                 /*!<  Peripheral Reset Enable Register,                     Address offset: 0x14 */
  __IO uint32_t AHBRSTCR;               /*!<  Peripheral Reset Enable Register,                     Address offset: 0x18 */
  __IO uint32_t APBRSTCR1;              /*!<  APB Peripherals Reset Register1,                      Address offset: 0x1C */
  __IO uint32_t APBRSTCR2;              /*!<  APB Peripherals Reset Register1,                      Address offset: 0x20 */
}RMU_Type;


/* ================================================================================ */
/* ================                      IWDT                      ================ */
/* ================================================================================ */

typedef struct
{
  __O  uint32_t SERV;                   /*!<  IWDT Service Register,                                Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  IWDT Config Register,                                 Address offset: 0x04 */
  __I  uint32_t CNT;                    /*!<  IWDT Counter Register,                                Address offset: 0x08 */
  __IO uint32_t WIN;                    /*!<  IWDT Window Register,                                 Address offset: 0x0C */
  __IO uint32_t IER;                    /*!<  IWDT Interrupt Enable Register,                       Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  IWDT Interrupt Status Register,                       Address offset: 0x14 */
}IWDT_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */

typedef struct
{
  __O  uint32_t CR;                     /*!<  WWDT Control Register,                                Address offset: 0x00 */
  __IO uint32_t CFGR;                   /*!<  WWDT Config Register,                                 Address offset: 0x04 */
  __I  uint32_t CNT;                    /*!<  WWDT Counter Register,                                Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  WWDT Interrupt Enable Register,                       Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  WWDT Interrupt Status Register,                       Address offset: 0x10 */
  __I  uint32_t PSC;                    /*!<  WWDT Prescaler Register,                              Address offset: 0x14 */
}WWDT_Type;


/* ================================================================================ */
/* ================                       CMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t SYSCLKCR;               /*!<  System Clock Control Register,                        Address offset: 0x00 */
  __IO uint32_t RCHFCR;                 /*!<  RCHF Control Register,                                Address offset: 0x04 */
  __IO uint32_t RCHFTR;                 /*!<  RCHF Trim Register,                                   Address offset: 0x08 */
  __IO uint32_t PLLCR;                  /*!<  PLL Control Register,                                 Address offset: 0x0C */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x10 */
  __IO uint32_t RCLPTR;                 /*!<  RCLP Trim Register,                                   Address offset: 0x14 */
  __IO uint32_t XTLFCR;                 /*!<  XTLF Control Register,                                Address offset: 0x18 */
  __IO uint32_t LSCLKSEL;               /*!<  LSCLK Select Register,                                Address offset: 0x1C */
  __IO uint32_t XTHFCR;                 /*!<  XTHF Control Register,                                Address offset: 0x20 */
  __IO uint32_t RSV2[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t IER;                    /*!<  Interrupt Enable Register,                            Address offset: 0x2C */
  __IO uint32_t ISR;                    /*!<  Interrupt Status Register,                            Address offset: 0x30 */
  __IO uint32_t PCLKCR1;                /*!<  Peripheral bus Clock Control Register1,               Address offset: 0x34 */
  __IO uint32_t PCLKCR2;                /*!<  Peripheral bus Clock Control Register2,               Address offset: 0x38 */
  __IO uint32_t PCLKCR3;                /*!<  Peripheral bus Clock Control Register3,               Address offset: 0x3C */
  __IO uint32_t PCLKCR4;                /*!<  Peripheral bus Clock Control Register4,               Address offset: 0x40 */
  __IO uint32_t OPCCR1;                 /*!<  Peripheral Clock Config Register1,                    Address offset: 0x44 */
  __IO uint32_t OPCCR2;                 /*!<  Peripheral Clock Config Register 2,                   Address offset: 0x48 */
  __IO uint32_t OPCCR3;                 /*!<  Peripheral Clock Enable Register,                     Address offset: 0x4C */
  __IO uint32_t AHBMCR;                 /*!<  AHB Master Control Register,                          Address offset: 0x50 */
  __IO uint32_t RSV3[11];               /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
  __IO uint32_t CFDCR;                  /*!<  CANFD Clock Config Register,                          Address offset: 0x80 */
  __IO uint32_t CFDER;                  /*!<  CANFD Clock Enable Register,                          Address offset: 0x84 */
}CMU_Type;


/* ================================================================================ */
/* ================                      CLMx                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  Clock Monitor Control Register,                       Address offset: 0x00 */
  __IO uint32_t CFGR;                   /*!<  Clock Monitor Configuration Register,                 Address offset: 0x04 */
  __IO uint32_t CNTR;                   /*!<  Clock Monitor Count Value Register,                   Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  Clock Monitor Interrupt Flag Register,                Address offset: 0x0C */
  __IO uint32_t CMPH;                   /*!<  Clock Monitor Compare High Threshold Register,        Address offset: 0x10 */
  __IO uint32_t CMPL;                   /*!<  Clock Monitor Compare Low Threshold Register,         Address offset: 0x14 */
}CLM_Type;


/* ================================================================================ */
/* ================                       SVD                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFGR;                   /*!<  SVD Config Register,                                  Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  SVD Control Register,                                 Address offset: 0x04 */
  __IO uint32_t IER;                    /*!<  SVD Interrupt Enable Register,                        Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  SVD Interrupt Status Register,                        Address offset: 0x0C */
  __IO uint32_t VSR;                    /*!<  SVD reference Voltage Select Register,                Address offset: 0x10 */
}SVD_Type;


/* ================================================================================ */
/* ================                       AES                      ================ */
/* ================================================================================ */

