zmzdh/CAN_st_test/Drivers/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fg0xxa.h
typedef struct
{
  __IO uint32_t CR;                     /*!<  AES Control Register,                                 Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  AES Interrupt Enable Register,                        Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  AES Interrupt Status Register,                        Address offset: 0x08 */
  __IO uint32_t DIR;                    /*!<  AES Data Input Register,                              Address offset: 0x0C */
  __I  uint32_t DOR;                    /*!<  AES Data Output Register,                             Address offset: 0x10 */
  __IO uint32_t KEY0;                   /*!<  AES Key Register 0,                                   Address offset: 0x14 */
  __IO uint32_t KEY1;                   /*!<  AES Key Register 1,                                   Address offset: 0x18 */
  __IO uint32_t KEY2;                   /*!<  AES Key Register 2,                                   Address offset: 0x1C */
  __IO uint32_t KEY3;                   /*!<  AES Key Register 3,                                   Address offset: 0x20 */
  __IO uint32_t KEY4;                   /*!<  AES Key Register 4,                                   Address offset: 0x24 */
  __IO uint32_t KEY5;                   /*!<  AES Key Register 5,                                   Address offset: 0x28 */
  __IO uint32_t KEY6;                   /*!<  AES Key Register 6,                                   Address offset: 0x2C */
  __IO uint32_t KEY7;                   /*!<  AES Key Register 7,                                   Address offset: 0x30 */
  __IO uint32_t IVR0;                   /*!<  AES Initial Vector Register 0,                        Address offset: 0x34 */
  __IO uint32_t IVR1;                   /*!<  AES Initial Vector Register 1,                        Address offset: 0x38 */
  __IO uint32_t IVR2;                   /*!<  AES Initial Vector Register 2,                        Address offset: 0x3C */
  __IO uint32_t IVR3;                   /*!<  AES Initial Vector Register 3,                        Address offset: 0x40 */
  __IO uint32_t H0;                     /*!<  AES MultH parameter Register 0,                       Address offset: 0x44 */
  __IO uint32_t H1;                     /*!<  AES MultH parameter Register 1,                       Address offset: 0x48 */
  __IO uint32_t H2;                     /*!<  AES MultH parameter Register 2,                       Address offset: 0x4C */
  __IO uint32_t H3;                     /*!<  AES MultH parameter Register 3,                       Address offset: 0x50 */
}AES_Type;


/* ================================================================================ */
/* ================                       RNG                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  Rand Number Generator Control  Register,              Address offset: 0x00 */
  __I  uint32_t DOR;                    /*!<  Rand Number/DRD Generator Control Data Output Register,Address offset: 0x04 */
  __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x08 */
  __IO uint32_t SR;                     /*!<  Rand Number  Generator  Status  Register,             Address offset: 0x10 */
  __IO uint32_t CRCCR;                  /*!<  CRC  Data  Input  Register,                           Address offset: 0x14 */
  __IO uint32_t CRCDIR;                 /*!<  CRC  Control  Register,                               Address offset: 0x18 */
  __IO uint32_t CRCSR;                  /*!<  CRC  Status  Register,                                Address offset: 0x1C */
}RNG_Type;


/* ================================================================================ */
/* ================                      COMP                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!< ComparatorControl Register 1,                          Address offset: 0x00 */
} COMP_Type;

typedef struct
{
  __IO uint32_t ICR;                    /*!<  Comparator Interrupt Config Register,                 Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  Comparator Interrupt Status Register,                 Address offset: 0x14 */
  __IO uint32_t BUFCR;                  /*!<  Comparator Buffer Control Register,                   Address offset: 0x18 */
}COMP_COMMON_Type;


/* ================================================================================ */
/* ================                      HDIV                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t END;                    /*!<  Dividend Register,                                    Address offset: 0x00 */
  __IO uint32_t SOR;                    /*!<  Divisor Regsiter,                                     Address offset: 0x04 */
  __I  uint32_t QUOT;                   /*!<  Quotient Register,                                    Address offset: 0x08 */
  __I  uint32_t REMD;                   /*!<  Reminder Register,                                    Address offset: 0x0C */
  __I  uint32_t SR;                     /*!<  Status Register,                                      Address offset: 0x10 */
}HDIV_Type;


/* ================================================================================ */
/* ================                     I2CSMBx                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  I2C SMBus0 Control Register,                          Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  I2C SMBus0 Control Register,                          Address offset: 0x04 */
  __IO uint32_t IER;                    /*!<  I2C SMBus Intterupt Enable Register,                  Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  I2C Master Interrupt Status Register,                 Address offset: 0x0C */
  __IO uint32_t BGR;                    /*!<  I2C Master Baud Rate Setting Register,                Address offset: 0x10 */
  __IO uint32_t TCR;                    /*!<  I2C Master Timing Control Register,                   Address offset: 0x14 */
  __IO uint32_t TOR;                    /*!<  I2C Master TimeOut Register,                          Address offset: 0x18 */
  __I  uint32_t RXBUF;                  /*!<  I2C Master Receive Data Register,                     Address offset: 0x1C */
  __IO uint32_t TXBUF;                  /*!<  I2C Master Send Data Register,                        Address offset: 0x20 */
  __IO uint32_t SADR;                   /*!<  I2C Master Slave Address Register,                    Address offset: 0x24 */
  __I  uint32_t CRC_DR;                 /*!<  I2C Master CRC Data Register,                         Address offset: 0x28 */
  __IO uint32_t CRC_LFSR;               /*!<  I2C Master LFSR Register,                             Address offset: 0x2C */
  __IO uint32_t CRC_POLY;               /*!<  I2C Master CRC Polynomial Register,                   Address offset: 0x30 */
}I2CSMB_Type;


/* ================================================================================ */
/* ================                      I2Cx                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t MSPCFGR;                /*!<  I2Cx Master Config Register,                          Address offset: 0x00 */
  __IO uint32_t MSPCR;                  /*!<  I2Cx Master Control Register,                         Address offset: 0x04 */
  __IO uint32_t MSPIER;                 /*!<  I2Cx Master Intterupt Enable Register,                Address offset: 0x08 */
  __IO uint32_t MSPISR;                 /*!<  I2Cx Master Interrupt Status Register,                Address offset: 0x0C */
  __IO uint32_t MSPSR;                  /*!<  I2Cx Master Status Register,                          Address offset: 0x10 */
  __IO uint32_t MSPBGR;                 /*!<  I2Cx Master Baud rate Generator Register,             Address offset: 0x14 */
  __IO uint32_t MSPBUF;                 /*!<  I2Cx Master transfer Buffer,                          Address offset: 0x18 */
  __IO uint32_t MSPTCR;                 /*!<  I2Cx Master Timing Control Register,                  Address offset: 0x1C */
  __IO uint32_t MSPTOR;                 /*!<  I2Cx Master Time-Out Register,                        Address offset: 0x20 */
}I2C_Type;


/* ================================================================================ */
/* ================                      UART                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t IRCR;                   /*!<  Infrared modulation Control Register,                 Address offset: 0x00 */
}UART_COMMON_Type;


/* ================================================================================ */
/* ================                      UARTx                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<  UART Control Status Register,                         Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  UART Interrupt Enable Register,                       Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  UART Interrupt Status Register,                       Address offset: 0x08 */
  __IO uint32_t TODR;                   /*!<  UART Time-Out and Delay Register,                     Address offset: 0x0C */
  __I  uint32_t RXBUF;                  /*!<  UART Receive Buffer,                                  Address offset: 0x10 */
  __O  uint32_t TXBUF;                  /*!<  UART Transmit Buffer,                                 Address offset: 0x14 */
  __IO uint32_t BGR;                    /*!<  UART Baud rate Generator Register,                    Address offset: 0x18 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t MCR;                    /*!<  UART Mode Control Register,                           Address offset: 0x20 */
  __IO uint32_t LINCR;                  /*!<  UART LIN Control Register,                            Address offset: 0x24 */
  __I  uint32_t LINBSR;                 /*!<  UART LIN Baud Sync Register,                          Address offset: 0x28 */
  __IO uint32_t LINFTR;                 /*!<  UART LIN Frame Timeout Register,                      Address offset: 0x2C */
  __IO uint32_t LINTTR;                 /*!<  UART LIN Transmit Timing Register,                    Address offset: 0x30 */
  __I  uint32_t LINPSR;                 /*!<  UARTLINPre-sync baud register,                        Address offset: 0x34 */
  __I  uint32_t LINBKR;                 /*!<  UARTLINBreak counter register,                        Address offset: 0x38 */
  __IO uint32_t RSV2;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x3C */
  __IO uint32_t SCISR;                  /*!<  USART Smart Card Interrupt Status Register,           Address offset: 0x40 */
  __IO uint32_t SCIER;                  /*!<  USART Smart Card Interrupt Enable Register,           Address offset: 0x44 */
  __IO uint32_t FFCR;                   /*!<  USART Smart Card Frame Format Control Register,       Address offset: 0x48 */
  __IO uint32_t EGTR;                   /*!<  USART Smart Card Extra Guard Time Register,           Address offset: 0x4C */
  __IO uint32_t CODR;                   /*!<  USART Smart Card Clock Output Register,               Address offset: 0x50 */
  __IO uint32_t SCCR;                   /*!<  USART Smart Card Abort Waiting For Retransmit,        Address offset: 0x54 */
  __IO uint32_t RSV3[10];               /*!<  RESERVED REGISTER,                                    Address offset: 0x58 */
  __IO uint32_t LINSSCR;                /*!<  LIN Self-test Switch Control Register,                Address offset: 0x80 */
}UART_Type;


/* ================================================================================ */
/* ================                     LPUARTx                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<  LPUARTx Control Status Register,                      Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  LPUARTx Interrupt Enable Register,                    Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  LPUARTx Interrupt Status Register,                    Address offset: 0x08 */
  __IO uint32_t BMR;                    /*!<  LPUARTx Baud rate Modulation Register,                Address offset: 0x0C */
  __I  uint32_t RXBUF;                  /*!<  LPUARTx Receive Buffer Register,                      Address offset: 0x10 */
  __IO uint32_t TXBUF;                  /*!<  LPUARTx Transmit Buffer Register,                     Address offset: 0x14 */
  __IO uint32_t DMR;                    /*!<  LPUARTx data Matching Register,                       Address offset: 0x18 */
}LPUART_Type;


/* ================================================================================ */
/* ================                      SPIx                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  SPIx Control Register1,                               Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  SPIx Control Register2,                               Address offset: 0x04 */
  __IO uint32_t CR3;                    /*!<  SPIx Control Register3,                               Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  SPIx Interrupt Enable Register,                       Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  SPIx Status Register,                                 Address offset: 0x10 */
  __O  uint32_t TXBUF;                  /*!<  SPIx Transmit Buffer,                                 Address offset: 0x14 */
  __I  uint32_t RXBUF;                  /*!<  SPIx Receive Buffer,                                  Address offset: 0x18 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t I2SCR;                  /*!<  SPIx I2S Control Register,                            Address offset: 0x20 */
  __IO uint32_t I2SPR;                  /*!<  SPIx I2S Prescaler Register,                          Address offset: 0x24 */
}SPI_Type;


/* ================================================================================ */
/* ================                       CAN                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  CAN Control Register,                                 Address offset: 0x00 */
  __IO uint32_t MSR;                    /*!<  CAN mode select register,                             Address offset: 0x04 */
  __IO uint32_t BRPR;                   /*!<  CAN Baud rate Prescaler Register,                     Address offset: 0x08 */
  __IO uint32_t BTR;                    /*!<  CAN Bit Timing Register,                              Address offset: 0x0C */
  __I  uint32_t ECR;                    /*!<  CAN Error Counter Register,                           Address offset: 0x10 */
  __IO uint32_t ESR;                    /*!<  CAN Error Status Register,                            Address offset: 0x14 */
  __I  uint32_t SR;                     /*!<  CAN Status Register,                                  Address offset: 0x18 */
  __IO uint32_t RX_ISR;                 /*!<  CAN Interrupt Status Register,                        Address offset: 0x1C */
  __IO uint32_t RX_IER;                 /*!<  CAN Interrupt Enable Register,                        Address offset: 0x20 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t TXB_CR;                 /*!<  CAN Transmit Buffer Control Register,                 Address offset: 0x28 */
  __IO uint32_t TXB_SR;                 /*!<  CAN Transmit Buffer Status Register,                  Address offset: 0x2C */
  __O  uint32_t TXB0_IDR;               /*!<  CAN Transmit Buffer 0 ID Register,                    Address offset: 0x30 */
  __O  uint32_t TXB0_DLCR;              /*!<  CAN Transmit Buffer 0 DLC Register,                   Address offset: 0x34 */
  __O  uint32_t TXB0_DW1R;              /*!<  CAN Transmit Buffer 0 DataWord1 Register,             Address offset: 0x38 */
  __O  uint32_t TXB0_DW2R;              /*!<  CAN Transmit Buffer 0 DataWord2 Register,             Address offset: 0x3C */
  __O  uint32_t TXB1_IDR;               /*!<  CAN Transmit Buffer 1 ID Register,                    Address offset: 0x40 */
  __O  uint32_t TXB1_DLCR;              /*!<  CAN Transmit Buffer 1 DLC Register,                   Address offset: 0x44 */
  __O  uint32_t TXB1_DW1R;              /*!<  CAN Transmit Buffer 1 DataWord1 Register,             Address offset: 0x48 */
  __O  uint32_t TXB1_DW2R;              /*!<  CAN Transmit Buffer 1 DataWord2 Register,             Address offset: 0x4C */
  __O  uint32_t TXB2_IDR;               /*!<  CAN Transmit Buffer 2 ID Register,                    Address offset: 0x50 */
  __O  uint32_t TXB2_DLCR;              /*!<  CAN Transmit Buffer 2 DLC Register,                   Address offset: 0x54 */
  __O  uint32_t TXB2_DW1R;              /*!<  CAN Transmit Buffer 2 DataWord1 Register,             Address offset: 0x58 */
  __O  uint32_t TXB2_DW2R;              /*!<  CAN Transmit Buffer 2 DataWord2 Register,             Address offset: 0x5C */
  __IO uint32_t AFCR;                   /*!<  Acceptance Filter Control Register,                   Address offset: 0x60 */
  __IO uint32_t AFCFGR;                 /*!<  Acceptance Filter Config Register,                    Address offset: 0x64 */
  __IO uint32_t RSV2[6];                /*!<  RESERVED REGISTER,                                    Address offset: 0x68 */
  __IO uint32_t AFMR1;                  /*!<  Acceptance Filter Mask Register1,                     Address offset: 0x80 */
  __IO uint32_t AFIR1;                  /*!<  Acceptance Filter ID Register1,                       Address offset: 0x84 */
  __IO uint32_t AFMR2;                  /*!<  Acceptance Filter Mask Register2,                     Address offset: 0x88 */
  __IO uint32_t AFIR2;                  /*!<  Acceptance Filter ID Register2,                       Address offset: 0x8C */
  __IO uint32_t AFMR3;                  /*!<  Acceptance Filter Mask Register3,                     Address offset: 0x90 */
  __IO uint32_t AFIR3;                  /*!<  Acceptance Filter ID Register3,                       Address offset: 0x94 */
  __IO uint32_t AFMR4;                  /*!<  Acceptance Filter Mask Register4,                     Address offset: 0x98 */
  __IO uint32_t AFIR4;                  /*!<  Acceptance Filter ID Register4,                       Address offset: 0x9C */
  __IO uint32_t AFMR5;                  /*!<  Acceptance Filter Mask Register5,                     Address offset: 0xA0 */
  __IO uint32_t AFIR5;                  /*!<  Acceptance Filter ID Register5,                       Address offset: 0xA4 */
  __IO uint32_t AFMR6;                  /*!<  Acceptance Filter Mask Register6,                     Address offset: 0xA8 */
  __IO uint32_t AFIR6;                  /*!<  Acceptance Filter ID Register6,                       Address offset: 0xAC */
  __IO uint32_t AFMR7;                  /*!<  Acceptance Filter Mask Register7,                     Address offset: 0xB0 */
  __IO uint32_t AFIR7;                  /*!<  Acceptance Filter ID Register7,                       Address offset: 0xB4 */
  __IO uint32_t AFMR8;                  /*!<  Acceptance Filter Mask Register8,                     Address offset: 0xB8 */
  __IO uint32_t AFIR8;                  /*!<  Acceptance Filter ID Register8,                       Address offset: 0xBC */
  __IO uint32_t AFMR9;                  /*!<  Acceptance Filter Mask Register9,                     Address offset: 0xC0 */
  __IO uint32_t AFIR9;                  /*!<  Acceptance Filter ID Register9,                       Address offset: 0xC4 */
  __IO uint32_t AFMR10;                 /*!<  Acceptance Filter Mask Register10,                    Address offset: 0xC8 */
  __IO uint32_t AFIR10;                 /*!<  Acceptance Filter ID Register10,                      Address offset: 0xCC */
  __IO uint32_t AFMR11;                 /*!<  Acceptance Filter Mask Register11,                    Address offset: 0xD0 */
  __IO uint32_t AFIR11;                 /*!<  Acceptance Filter ID Register11,                      Address offset: 0xD4 */
  __IO uint32_t AFMR12;                 /*!<  Acceptance Filter Mask Register12,                    Address offset: 0xD8 */
  __IO uint32_t AFIR12;                 /*!<  Acceptance Filter ID Register12,                      Address offset: 0xDC */
  __IO uint32_t AFMR13;                 /*!<  Acceptance Filter Mask Register13,                    Address offset: 0xE0 */
  __IO uint32_t AFIR13;                 /*!<  Acceptance Filter ID Register13,                      Address offset: 0xE4 */
  __IO uint32_t AFMR14;                 /*!<  Acceptance Filter Mask Register14,                    Address offset: 0xE8 */
  __IO uint32_t AFIR14;                 /*!<  Acceptance Filter ID Register14,                      Address offset: 0xEC */
  __IO uint32_t AFMR15;                 /*!<  Acceptance Filter Mask Register15,                    Address offset: 0xF0 */
  __IO uint32_t AFIR15;                 /*!<  Acceptance Filter ID Register15,                      Address offset: 0xF4 */
  __IO uint32_t AFMR16;                 /*!<  Acceptance Filter Mask Register16,                    Address offset: 0xF8 */
  __IO uint32_t AFIR16;                 /*!<  Acceptance Filter ID Register16,                      Address offset: 0xFC */
  __O  uint32_t RXF_IDR;                /*!<  CAN RX FIFO ID Register,                              Address offset: 0x100 */
  __O  uint32_t RXF_DLCR;               /*!<  CAN RX FIFO DLC Register,                             Address offset: 0x104 */
  __O  uint32_t RXF_DW1R;               /*!<  CAN RX FIFO Data Word1 Register,                      Address offset: 0x108 */
  __O  uint32_t RXF_DW2R;               /*!<  CAN RX FIFO Data Word2 Register,                      Address offset: 0x10C */
}CAN_Type;


/* ================================================================================ */
/* ================                     CANFDx                     ================ */
/* ================================================================================ */

