zmzdh/CAN_st_test/Drivers/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fg0xxa.h
typedef struct
{
  __IO uint32_t CFDC0NCFG;              /*!<  Channel 0 Nominal Bitrate Configuration Register,                                Address offset: 0000h                 */
  __IO uint32_t CFDC0CTR;               /*!<  Channel 0 Control Register,                                                      Address offset: 0004h                 */
  __IO uint32_t CFDC0STS;               /*!<  Channel 0 Status Register,                                                       Address offset: 0008h                 */
  __IO uint32_t CFDC0ERFL;              /*!<  Channel 0 Error Flag Register,                                                   Address offset: 000Ch                 */
  __IO uint32_t CFDGIPV;                /*!<  Global IP Version Register,                                                      Address offset: 0010h                 */
  __IO uint32_t CFDGCFG;                /*!<  Global Configuration Register,                                                   Address offset: 0014h                 */
  __IO uint32_t CFDGCTR;                /*!<  Global Control Register,                                                         Address offset: 0018h                 */
  __IO uint32_t CFDGSTS;                /*!<  Global Status Register,                                                          Address offset: 001Ch                 */
  __IO uint32_t CFDGERFL;               /*!<  Global Error Flag Register,                                                      Address offset: 0020h                 */
  __IO uint32_t CFDGTSC;                /*!<  Global Timestamp Counter Register,                                               Address offset: 0024h                 */
  __IO uint32_t CFDGAFLECTR;            /*!<  Global Acceptance Filter List Entry Control Register,                            Address offset: 0028h                 */
  __IO uint32_t CFDGAFLCFG;             /*!<  Global Acceptance Filter List Configuration Register,                            Address offset: 002Ch                 */
  __IO uint32_t CFDRMNB;                /*!<  RX Message Buffer Number Register,                                               Address offset: 0030h                 */
  __IO uint32_t CFDRMND;                /*!<  RX Message Buffer New Data Register,                                             Address offset: 0034h                 */
  __IO uint32_t CFDRMIEC;               /*!<  RX Message Buffer Interrupt Enable Configuration Register,                       Address offset: 0038h                 */
  __IO uint32_t CFDRFCC[2];             /*!<  RX FIFO Configuration / Control Registers a = [0:1],                             Address offset: 003Ch + a*0004h       */
  __IO uint32_t CFDRFSTS[2];            /*!<  RX FIFO Status Registers a = [0:1],                                              Address offset: 0044h + a*0004h       */
  __IO uint32_t CFDRFPCTR[2];           /*!<  RX FIFO Pointer Control Registers a = [0:1],                                     Address offset: 004Ch + a*0004h       */
  __IO uint32_t CFDCFCC;                /*!<  Common FIFO Configuration / Control Register,                                    Address offset: 0054h                 */
  __IO uint32_t CFDCFSTS;               /*!<  Common FIFO Status Register,                                                     Address offset: 0058h                 */
  __IO uint32_t CFDCFPCTR;              /*!<  Common FIFO Pointer Control Register ,                                           Address offset: 005Ch                 */
  __IO uint32_t CFDFESTS;               /*!<  FIFO Empty Status Register,                                                      Address offset: 0060h                 */
  __IO uint32_t CFDFFSTS;               /*!<  FIFO Full Status Register,                                                       Address offset: 0064h                 */
  __IO uint32_t CFDFMSTS;               /*!<  FIFO Message Lost Status Register,                                               Address offset: 0068h                 */
  __IO uint32_t CFDRFISTS;              /*!<  RX FIFO Interrupt Flag Status Register,                                          Address offset: 006Ch                 */
  __IO uint8_t  CFDTMC[4];              /*!<  TX Message Buffer Control Registers I = [0:3],                                   Address offset: 0070h + i*0001h       */
  __IO uint8_t  CFDTMSTS[4];            /*!<  TX Message Buffer Status Registers j = [0:3],                                    Address offset: 0074h + j*0001h       */
  __IO uint32_t CFDTMTRSTS;             /*!<  TX Message Buffer Transmission Request Status Register,                          Address offset: 0078h                 */
  __IO uint32_t CFDTMTARSTS;            /*!<  TX Message Buffer Transmission Abort Request Status Register,                    Address offset: 007Ch                 */
  __IO uint32_t CFDTMTCSTS;             /*!<  TX Message Buffer Transmission Completion Status Register,                       Address offset: 0080h                 */
  __IO uint32_t CFDTMTASTS;             /*!<  TX Message Buffer Transmission Abort Status Register,                            Address offset: 0084h                 */
  __IO uint32_t CFDTMIEC;               /*!<  TX Message Buffer Interrupt Enable Configuration Register,                       Address offset: 0088h                 */
  __IO uint32_t CFDTXQCC;               /*!<  TX Queue Configuration / Control Register,                                       Address offset: 008Ch                 */
  __IO uint32_t CFDTXQSTS;              /*!<  TX Queue Status Register,                                                        Address offset: 0090h                 */
  __IO uint32_t CFDTXQPCTR;             /*!<  TX Queue Pointer Control Register,                                               Address offset: 0094h                 */
  __IO uint32_t CFDTHLCC;               /*!<  TX History List Configuration / Control Register,                                Address offset: 0098h                 */
  __IO uint32_t CFDTHLSTS;              /*!<  TX History List Status Register,                                                 Address offset: 009Ch                 */
  __IO uint32_t CFDTHLPCTR;             /*!<  TX History List Pointer Control Register,                                        Address offset: 00A0h                 */
  __IO uint32_t CFDGTINTSTS;            /*!<  Global TX Interrupt Status Register,                                             Address offset: 00A4h                 */
  __IO uint32_t CFDGTSTCFG;             /*!<  Global Test Configuration Register,                                              Address offset: 00A8h                 */
  __IO uint32_t CFDGTSTCTR;             /*!<  Global Test Control Register,                                                    Address offset: 00ACh                 */
  __IO uint32_t CFDGFDCFG;              /*!<  Global FD Configuration register,                                                Address offset: 00B0h                 */
  __IO uint32_t RSVD;                   /*!<  RESERVED REGISTER,                                                               Address offset: 00B4h                 */
  __IO uint32_t CFDGLOCKK;              /*!<  Global Lock Key Register,                                                        Address offset: 00B8h                 */
  __IO uint32_t RSVD1;                  /*!<  RESERVED REGISTER,                                                               Address offset: 00BCh                 */
  __IO uint32_t CFDGAFLIGNENT;          /*!<  Global AFL Ignore Entry Register,                                                Address offset: 00C0h                 */
  __IO uint32_t CFDGAFLIGNCTR;          /*!<  Global AFL Ignore Control Register,                                              Address offset: 00C4h                 */
  __IO uint32_t CFDCDTCT;               /*!<  DMA Transfer Control Register,                                                   Address offset: 00C8h                 */
  __IO uint32_t CFDCDTSTS;              /*!<  DMA Transfer Status Register,                                                    Address offset: 00CCh                 */
  __IO uint32_t CFDGPFLECTR;            /*!<  Pretended Network Filter List Entry control Register,                            Address offset: 00D0h                 */
  __IO uint32_t CFDGPFLCFG;             /*!<  Pretended Network Filter List Entry Configuration Register,                      Address offset: 00D4h                 */
  __IO uint32_t CFDGRSTC;               /*!<  Global SW reset Register,                                                        Address offset: 00D8h                 */
  __IO uint32_t RSVD2[9];               /*!<  RESERVED REGISTER,                                                               Address offset: 00DCh                 */
  __IO uint32_t CFDC0DCFG;              /*!<  Channel 0 Data Bitrate Configuration Register,                                   Address offset: 0100h                 */
  __IO uint32_t CFDC0FDCFG;             /*!<  Channel 0 CAN-FD Configuration Register,                                         Address offset: 0104h                 */
  __IO uint32_t CFDC0FDCTR;             /*!<  Channel 0 CAN-FD Control Register,                                               Address offset: 0108h                 */
  __IO uint32_t CFDC0FDSTS;             /*!<  Channel 0 CAN-FD Status Register,                                                Address offset: 010Ch                 */
  __IO uint32_t CFDC0FDCRC;             /*!<  Channel 0 CAN-FD CRC Register,                                                   Address offset: 0110h                 */
  __IO uint32_t RSVD3[3];               /*!<  RESERVED REGISTER,                                                               Address offset: 0114h                 */
  struct                                                                                                                       
  {                                                                                                                            
    __IO uint32_t CFDGAFLIDr;           /*!<  Global Acceptance Filter List ID Registers r = [1＃10]h,                         Address offset: 0120h + (r-1)*0010h   */
    __IO uint32_t CFDGAFLMr;            /*!<  Global Acceptance Filter List Mask Registers r = [1＃10]h,                       Address offset: 0124h + (r-1)*0010h   */
    __IO uint32_t CFDGAFLP0r;           /*!<  Global Acceptance Filter List Pointer 0 Registers r = [1＃10]h,                  Address offset: 0128h + (r-1)*0010h   */
    __IO uint32_t CFDGAFLP1r;           /*!<  Global Acceptance Filter List Pointer 1 Registers r = [1＃10]h,                  Address offset: 012Ch + (r-1)*0010h   */
  }CFDGAFL[16];	                        
  struct                                
  {                                     
    __IO uint32_t CFDGPFLIDs;           /*!<  Global Pretended Network Filter List ID Registers s = [1＃2]h,                   Address offset: 0220h + (s-1) * 0024h */
    __IO uint32_t CFDGPFLMs;            /*!<  Global Pretended Network Filter List Mask Registers s = [1＃2]h,                 Address offset: 0224h + (s-1) * 0024h */
    __IO uint32_t CFDGPFLP0s;           /*!<  Global Pretended Network Filter List Pointer 0 Registers s = [1＃2]h,            Address offset: 0228h + (s-1) * 0024h */
    __IO uint32_t CFDGPFLP1s;           /*!<  Global Pretended Network Filter List Pointer 1 Registers s = [1＃2]h,            Address offset: 022Ch + (s-1) * 0024h */
    __IO uint32_t CFDGPFLPTs;           /*!<  Global Pretended Network Filter List Filter Payload Type Registers s = [1＃2]h,  Address offset: 0230h + (s-1) * 0024h */
    __IO uint32_t CFDGPFLPD0s;          /*!<  Global Pretended Network Filter List Payload Data 0 Registers s = [1＃2],        Address offset: 0234h + (s-1) * 0024h */
    __IO uint32_t CFDGPFLPM0s;          /*!<  Global Pretended Network Filter List Payload Mask 0 Registers s = [1＃2]h,       Address offset: 0238h + (s-1) * 0024h */ 
    __IO uint32_t CFDGPFLPD1s;          /*!<  Global Pretended Network Filter List Payload Data 1 Registers s = [1＃2]h,       Address offset: 023Ch + (s-1) * 0024h */
    __IO uint32_t CFDGPFLPM1s;          /*!<  Global Pretended Network Filter List Payload Mask 1 Registers s = [1＃2]h,       Address offset: 0240h + (s-1) * 0024h */
  }CFDGPFL[2];                                                                                                                 
  __IO uint32_t RSVD4[6];               /*!<  RESERVED REGISTER,                                                               Address offset: 0268h                 */
  __IO uint32_t CFDRPGACC[64];          /*!<  RAM Test Page Access Registers k = [0＃3F]h,                                     Address offset: 0280h + k * 0004h     */
}CANFD_COMMON_Type;


/* ================================================================================ */
/* ================                     CANFDx_RX_FIFO             ================ */
/* ================================================================================ */

typedef struct
{
  struct
  {
    __IO uint32_t CFDRFIDb;             /*!<  RX FIFO Access ID Registers b = [0＃1]h,                                         Address offset: 0520h + b * 004Ch             */
    __IO uint32_t CFDRFPTRb;            /*!<  RX FIFO Access Pointer Registers b = [0＃1]h,                                    Address offset: 0524h + b * 004Ch             */
    __IO uint32_t CFDRFFDSTSb;          /*!<  RX FIFO Access CAN-FD Status Registers b = [0＃1]h,                              Address offset: 0528h + b * 004Ch             */
    __IO uint32_t CFDRFDFbp[16];        /*!<  RX FIFO Access Data Field p Registers b = [0＃1]h p = [0＃F]h,                   Address offset: 052Ch + p * 0004h + b * 004Ch */
  }CFDRF[2];
}CANFD_RX_FIFO_Type;

/* ================================================================================ */
/* ================                     CANFDx_Common_FIFO             ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFDCFID;                /*!<  Common FIFO Access ID Register,                                                  Address offset: 05B8h                         */
  __IO uint32_t CFDCFPTR;               /*!<  Common FIFO Access Pointer Register,                                             Address offset: 05BCh                         */
  __IO uint32_t CFDCFFDCSTS;            /*!<  Common FIFO Access CAN-FD Control/Status Register,                               Address offset: 05C0h                         */
  __IO uint32_t CFDCFDFp[16];           /*!<  Common FIFO Access Data Field p Registers p = [0＃F]h,                           Address offset: 05C4h + p * 0004h             */
}CANFD_COMMON_FIFO_Type;

/* ================================================================================ */
/* ================                     CANFDx_TX_MESSAGE          ================ */
/* ================================================================================ */

typedef struct
{
   struct
   {
     __IO uint32_t CFDTMIDb;             /*!<  TX Message Buffer ID Registers b = [0＃3]h,                                      Address offset: 0604h + b * 004Ch             */
     __IO uint32_t CFDTMPTRb;            /*!<  TX Message Buffer Pointer Registers b = [0＃3]h,                                 Address offset: 0608h + b * 004Ch             */
     __IO uint32_t CFDTMFDCTRb;          /*!<  TX Message Buffer CAN-FD Control Registers b = [0＃3]h,                          Address offset: 060Ch + b * 004Ch             */
     __IO uint32_t CFDTMDFbp[16];        /*!<  TX Message Buffer Data Field p Registers b = [0＃3]h p = [0＃F]h,                Address offset: 0610h + p * 0004h + b * 004Ch */
   }CFDTM[4];
}CANFD_TX_MESSAGE_Type;

/* ================================================================================ */
/* ================                     CANFDx_TX_HISTORY_LIST          ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFDTHLACC0;             /*!<  Channel 0 TX History List Access Registers 0,                                    Address offset: 0740h                         */
  __IO uint32_t CFDTHLACC1;             /*!<  Channel 0 TX History List Access Registers 1,                                    Address offset: 0744h                         */
}CANFD_TX_HISTORY_LIST_Type;


/* ================================================================================ */
/* ================                     CANFDx_RX_MESSAGE          ================ */
/* ================================================================================ */

typedef struct
{
  struct
  {
    __IO uint32_t CFDRMIDb;             /*!<  RX Message Buffer ID Registers b = [0＃7]h,                                      Address offset: 0920h + b * 004Ch             */
    __IO uint32_t CFDRMPTRb;            /*!<  RX Message Buffer Pointer Registers b = [0＃7]h,                                 Address offset: 0924h + b * 004Ch             */
    __IO uint32_t CFDRMFDSTSb;          /*!<  RX Message Buffer CAN-FD Status Registers b = [0＃7]h,                           Address offset: 0928h + b * 004Ch             */
    __IO uint32_t CFDRMDFbp[16];        /*!<  RX Message Buffer Data Field p Registers b = [0＃7]h p = [0＃F]h,                Address offset: 092Ch + p * 0004h + b * 004Ch */
  }CFDRM[8];
}CANFD_RX_MESSAGE_Type;


/* ================================================================================ */
/* ================                      SENTx                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  SENTxControl Register,                                Address offset: 0x00 */
  __IO uint32_t CFGR;                   /*!<  SENTx Configure Register,                             Address offset: 0x04 */
  __IO uint32_t PSR;                    /*!<  SENTx Prescaler Register,                             Address offset: 0x08 */
  __IO uint32_t FTR;                    /*!<  SENTx Frame Length Register,                          Address offset: 0x0C */
  __IO uint32_t SR;                     /*!<  SENTxStatus and Flag Register,                        Address offset: 0x10 */
  __IO uint32_t DR;                     /*!<  SENTx Data Register,                                  Address offset: 0x14 */
  __IO uint32_t SYNC;                   /*!<  SENTx Synchronous Pluse Diagnosis Register,           Address offset: 0x18 */
  __I  uint32_t RCAL;                   /*!<  SENTx Synchronous Calibration Register,               Address offset: 0x1C */
}SENT_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t GCR;                    /*!<  DMA Global Control Register,                          Address offset: 0x00 */
  __IO uint32_t CH0CR;                  /*!<  Channel 0 Control Register,                           Address offset: 0x04 */
  __IO uint32_t CH0MAR;                 /*!<  Channel 0 Memory Address Register,                    Address offset: 0x08 */
  __IO uint32_t CH1CR;                  /*!<  Channel 1 Control Register,                           Address offset: 0x0C */
  __IO uint32_t CH1MAR;                 /*!<  Channel 1 Memory Address Register,                    Address offset: 0x10 */
  __IO uint32_t CH2CR;                  /*!<  Channel 2 Control Register,                           Address offset: 0x14 */
  __IO uint32_t CH2MAR;                 /*!<  Channel 2 Memory Address Register,                    Address offset: 0x18 */
  __IO uint32_t CH3CR;                  /*!<  Channel 3 Control Register,                           Address offset: 0x1C */
  __IO uint32_t CH3MAR;                 /*!<  Channel 3 Memory Address Register,                    Address offset: 0x20 */
  __IO uint32_t CH4CR;                  /*!<  Channel 4 Control Register,                           Address offset: 0x24 */
  __IO uint32_t CH4MAR;                 /*!<  Channel 4 Memory Address Register,                    Address offset: 0x28 */
  __IO uint32_t CH5CR;                  /*!<  Channel 5 Control Register,                           Address offset: 0x2C */
  __IO uint32_t CH5MAR;                 /*!<  Channel 5 Memory Address Register,                    Address offset: 0x30 */
  __IO uint32_t CH6CR;                  /*!<  Channel 6 Control Register,                           Address offset: 0x34 */
  __IO uint32_t CH6MAR;                 /*!<  Channel 6 Memory Address Register,                    Address offset: 0x38 */
  __IO uint32_t CH7CR;                  /*!<  Channel 7 Control Register,                           Address offset: 0x3C */
  __IO uint32_t CH7FLSAD;               /*!<  Channel 7 Flash Address Register,                     Address offset: 0x40 */
  __IO uint32_t CH7RAMAD;               /*!<  Channel 7 RAM Address Register,                       Address offset: 0x44 */
  __IO uint32_t ISR;                    /*!<  DMA Interrupt Status Register,                        Address offset: 0x48 */
}DMA_Type;


/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t DR;                     /*!<  CRC Data Register,                                    Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  CRC Control Register,                                 Address offset: 0x04 */
  __IO uint32_t LFSR;                   /*!<  CRC Linear Feedback Shift Register,                   Address offset: 0x08 */
  __IO uint32_t XOR;                    /*!<  CRC output XOR Register,                              Address offset: 0x0C */
  __IO uint32_t RSV1[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x10 */
  __IO uint32_t POLY;                   /*!<  CRC Polynominal Register,                             Address offset: 0x1C */
}CRC_Type;


/* ================================================================================ */
/* ================                      ATIM                      ================ */
/* ================================================================================ */

