zmzdh/CAN_st_test/Drivers/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fg0xxa.h
typedef struct
{
  __IO uint32_t CR1;                    /*!<  ATIM Control Register1,                               Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  ATIM Control Register2,                               Address offset: 0x04 */
  __IO uint32_t SMCR;                   /*!<  ATIM Slave Mode Control Register,                     Address offset: 0x08 */
  __IO uint32_t DIER;                   /*!<  ATIM DMA and Interrupt Enable Register,               Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  ATIM Interrupt Status Register,                       Address offset: 0x10 */
  __O  uint32_t EGR;                    /*!<  ATIM Event Generation Register,                       Address offset: 0x14 */
  __IO uint32_t CCMR1;                  /*!<  ATIM Capture/Compare Mode Register1,                  Address offset: 0x18 */
  __IO uint32_t CCMR2;                  /*!<  ATIM Capture/Compare Mode Register2,                  Address offset: 0x1C */
  __IO uint32_t CCER;                   /*!<  ATIM Capture/Compare Enable Register,                 Address offset: 0x20 */
  __IO uint32_t CNT;                    /*!<  ATIM Counter Register,                                Address offset: 0x24 */
  __IO uint32_t PSC;                    /*!<  ATIM Prescaler Register,                              Address offset: 0x28 */
  __IO uint32_t ARR;                    /*!<  ATIM Auto-Reload Register,                            Address offset: 0x2C */
  __IO uint32_t RCR;                    /*!<  ATIM Repetition Counter Register,                     Address offset: 0x30 */
  __IO uint32_t CCR1;                   /*!<  ATIM Capture/Compare Register1,                       Address offset: 0x34 */
  __IO uint32_t CCR2;                   /*!<  ATIM Capture/Compare Register2,                       Address offset: 0x38 */
  __IO uint32_t CCR3;                   /*!<  ATIM Capture/Compare Register3,                       Address offset: 0x3C */
  __IO uint32_t CCR4;                   /*!<  ATIM Capture/Compare Register4,                       Address offset: 0x40 */
  __IO uint32_t BDTR;                   /*!<  ATIM Break and Deadtime Register,                     Address offset: 0x44 */
  __IO uint32_t DCR;                    /*!<  ATIM DMA Control Register,                            Address offset: 0x48 */
  __IO uint32_t DMAR;                   /*!<  ATIM DMA Access Register,                             Address offset: 0x4C */
  __IO uint32_t RSV1[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x50 */
  __IO uint32_t BKCR;                   /*!<  ATIM Break Control Register,                          Address offset: 0x60 */
}ATIM_Type;


/* ================================================================================ */
/* ================                     GPTIMx                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  GPTIMx Control Register1,                             Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  GPTIMx Control Register2,                             Address offset: 0x04 */
  __IO uint32_t SMCR;                   /*!<  GPTIMx Slave Mode Control Register,                   Address offset: 0x08 */
  __IO uint32_t DIER;                   /*!<  GPTIMx DMA and Interrupt Enable Register,             Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  GPTIMx Interrupt Status Register,                     Address offset: 0x10 */
  __O  uint32_t EGR;                    /*!<  GPTIMx Event Generation Register,                     Address offset: 0x14 */
  __IO uint32_t CCMR1;                  /*!<  GPTIMx Capture/Compare Mode Register1,                Address offset: 0x18 */
  __IO uint32_t CCMR2;                  /*!<  GPTIMx Capture/Compare Mode Register2,                Address offset: 0x1C */
  __IO uint32_t CCER;                   /*!<  GPTIMx Capture/Compare Enable Register,               Address offset: 0x20 */
  __IO uint32_t CNT;                    /*!<  GPTIMx Counter Register,                              Address offset: 0x24 */
  __IO uint32_t PSC;                    /*!<  GPTIMx Prescaler Register,                            Address offset: 0x28 */
  __IO uint32_t ARR;                    /*!<  GPTIMx Auto-Reload Register,                          Address offset: 0x2C */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x30 */
  __IO uint32_t CCR1;                   /*!<  GPTIMx Capture/Compare Register1,                     Address offset: 0x34 */
  __IO uint32_t CCR2;                   /*!<  GPTIMx Capture/Compare Register2,                     Address offset: 0x38 */
  __IO uint32_t CCR3;                   /*!<  GPTIMx Capture/Compare Register3,                     Address offset: 0x3C */
  __IO uint32_t CCR4;                   /*!<  GPTIMx Capture/Compare Register4,                     Address offset: 0x40 */
  __IO uint32_t RSV2;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x44 */
  __IO uint32_t DCR;                    /*!<  GPTIMx DMA Control Register,                          Address offset: 0x48 */
  __IO uint32_t DMAR;                   /*!<  GPTIMx DMA access Register,                           Address offset: 0x4C */
  __IO uint32_t RSV3[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x50 */
  __IO uint32_t ITRSEL;                 /*!<  GPTIMx Internal Trigger Select Register,              Address offset: 0x60 */
}GPTIM_Type;


/* ================================================================================ */
/* ================                      TAU                       ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t TAU0CR;                 /*!<  TAU0 Control Register,                                Address offset: 0x00 */
  __IO uint32_t TAU1CR;                 /*!<  TAU1 Control Register,                                Address offset: 0x04 */
}TAU_COMMON_Type;



/* ================================================================================ */
/* ================                      TAU0                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t T0CFGR;                 /*!<  TAU0's Channel0 Configuration Register,               Address offset: 0x00 */
  __IO uint32_t T1CFGR;                 /*!<  TAU0's Channel1 Configuration Register,               Address offset: 0x04 */
  __IO uint32_t T2CFGR;                 /*!<  TAU0's Channel2 Configuration Register,               Address offset: 0x08 */
  __IO uint32_t T3CFGR;                 /*!<  TAU0's Channel3 Configuration Register,               Address offset: 0x0C */
  __IO uint32_t T4CFGR;                 /*!<  TAU0's Channel4 Configuration Register,               Address offset: 0x10 */
  __IO uint32_t T5CFGR;                 /*!<  TAU0's Channel5 Configuration Register,               Address offset: 0x14 */
  __IO uint32_t T6CFGR;                 /*!<  TAU0's Channel6 Configuration Register,               Address offset: 0x18 */
  __IO uint32_t T7CFGR;                 /*!<  TAU0's Channel7 Configuration Register,               Address offset: 0x1C */
  __IO uint32_t T0MDR;                  /*!<  TAU0's Channel0 Mode Register,                        Address offset: 0x20 */
  __IO uint32_t T1MDR;                  /*!<  TAU0's Channel1 Mode Register,                        Address offset: 0x24 */
  __IO uint32_t T2MDR;                  /*!<  TAU0's Channel2 Mode Register,                        Address offset: 0x28 */
  __IO uint32_t T3MDR;                  /*!<  TAU0's Channel3 Mode Register,                        Address offset: 0x2C */
  __IO uint32_t T4MDR;                  /*!<  TAU0's Channel4 Mode Register,                        Address offset: 0x30 */
  __IO uint32_t T5MDR;                  /*!<  TAU0's Channel5 Mode Register,                        Address offset: 0x34 */
  __IO uint32_t T6MDR;                  /*!<  TAU0's Channel6 Mode Register,                        Address offset: 0x38 */
  __IO uint32_t T7MDR;                  /*!<  TAU0's Channel7 Mode Register,                        Address offset: 0x3C */
  __IO uint32_t T0ARR;                  /*!<  TAU0 Auto-Reload Register0,                           Address offset: 0x40 */
  __IO uint32_t T1ARR;                  /*!<  TAU0 Auto-Reload Register1,                           Address offset: 0x44 */
  __IO uint32_t T2ARR;                  /*!<  TAU0 Auto-Reload Register2,                           Address offset: 0x48 */
  __IO uint32_t T3ARR;                  /*!<  TAU0 Auto-Reload Register3,                           Address offset: 0x4C */
  __IO uint32_t T4ARR;                  /*!<  TAU0 Auto-Reload Register4,                           Address offset: 0x50 */
  __IO uint32_t T5ARR;                  /*!<  TAU0 Auto-Reload Register5,                           Address offset: 0x54 */
  __IO uint32_t T6ARR;                  /*!<  TAU0 Auto-Reload Register6,                           Address offset: 0x58 */
  __IO uint32_t T7ARR;                  /*!<  TAU0 Auto-Reload Register7,                           Address offset: 0x5C */
  __IO uint32_t T0CCR;                  /*!<  TAU0 Capture/Compare Register0,                       Address offset: 0x60 */
  __IO uint32_t T1CCR;                  /*!<  TAU0 Capture/Compare Register1,                       Address offset: 0x64 */
  __IO uint32_t T2CCR;                  /*!<  TAU0 Capture/Compare Register2,                       Address offset: 0x68 */
  __IO uint32_t T3CCR;                  /*!<  TAU0 Capture/Compare Register3,                       Address offset: 0x6C */
  __IO uint32_t T4CCR;                  /*!<  TAU0 Capture/Compare Register4,                       Address offset: 0x70 */
  __IO uint32_t T5CCR;                  /*!<  TAU0 Capture/Compare Register5,                       Address offset: 0x74 */
  __IO uint32_t T6CCR;                  /*!<  TAU0 Capture/Compare Register6,                       Address offset: 0x78 */
  __IO uint32_t T7CCR;                  /*!<  TAU0 Capture/Compare Register7,                       Address offset: 0x7C */
  __IO uint32_t T0IER;                  /*!<  TAU0 Interrupt Enable Register0,                      Address offset: 0x80 */
  __IO uint32_t T1IER;                  /*!<  TAU0 Interrupt Enable Register1,                      Address offset: 0x84 */
  __IO uint32_t T2IER;                  /*!<  TAU0 Interrupt Enable Register2,                      Address offset: 0x88 */
  __IO uint32_t T3IER;                  /*!<  TAU0 Interrupt Enable Register3,                      Address offset: 0x8C */
  __IO uint32_t T4IER;                  /*!<  TAU0 Interrupt Enable Register4,                      Address offset: 0x90 */
  __IO uint32_t T5IER;                  /*!<  TAU0 Interrupt Enable Register5,                      Address offset: 0x94 */
  __IO uint32_t T6IER;                  /*!<  TAU0 Interrupt Enable Register6,                      Address offset: 0x98 */
  __IO uint32_t T7IER;                  /*!<  TAU0 Interrupt Enable Register7,                      Address offset: 0x9C */
  __IO uint32_t T0ISR;                  /*!<  TAU0 Interrupt Status Register0,                      Address offset: 0xA0 */
  __IO uint32_t T1ISR;                  /*!<  TAU0 Interrupt Status Register1,                      Address offset: 0xA4 */
  __IO uint32_t T2ISR;                  /*!<  TAU0 Interrupt Status Register2,                      Address offset: 0xA8 */
  __IO uint32_t T3ISR;                  /*!<  TAU0 Interrupt Status Register3,                      Address offset: 0xAC */
  __IO uint32_t T4ISR;                  /*!<  TAU0 Interrupt Status Register4,                      Address offset: 0xB0 */
  __IO uint32_t T5ISR;                  /*!<  TAU0 Interrupt Status Register5,                      Address offset: 0xB4 */
  __IO uint32_t T6ISR;                  /*!<  TAU0 Interrupt Status Register6,                      Address offset: 0xB8 */
  __IO uint32_t T7ISR;                  /*!<  TAU0 Interrupt Status Register7,                      Address offset: 0xBC */
  __I  uint32_t T0CNTR;                 /*!<  TAU0 Counter Register0,                               Address offset: 0xC0 */
  __I  uint32_t T1CNTR;                 /*!<  TAU0 Counter Register1,                               Address offset: 0xC4 */
  __I  uint32_t T2CNTR;                 /*!<  TAU0 Counter Register2,                               Address offset: 0xC8 */
  __I  uint32_t T3CNTR;                 /*!<  TAU0 Counter Register3,                               Address offset: 0xCC */
  __I  uint32_t T4CNTR;                 /*!<  TAU0 Counter Register4,                               Address offset: 0xD0 */
  __I  uint32_t T5CNTR;                 /*!<  TAU0 Counter Register5,                               Address offset: 0xD4 */
  __I  uint32_t T6CNTR;                 /*!<  TAU0 Counter Register6,                               Address offset: 0xD8 */
  __I  uint32_t T7CNTR;                 /*!<  TAU0 Counter Register7,                               Address offset: 0xDC */
}TAU0_Type;


/* ================================================================================ */
/* ================                      TAU1                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t T0CFGR;                 /*!<  TAU1's Channel0 Configuration Register,               Address offset: 0x110 */
  __IO uint32_t T1CFGR;                 /*!<  TAU1's Channel1 Configuration Register,               Address offset: 0x114 */
  __IO uint32_t T2CFGR;                 /*!<  TAU1's Channel2 Configuration Register,               Address offset: 0x118 */
  __IO uint32_t T3CFGR;                 /*!<  TAU1's Channel3 Configuration Register,               Address offset: 0x11C */
  __IO uint32_t T4CFGR;                 /*!<  TAU1's Channel4 Configuration Register,               Address offset: 0x120 */
  __IO uint32_t T5CFGR;                 /*!<  TAU1's Channel5 Configuration Register,               Address offset: 0x124 */
  __IO uint32_t T6CFGR;                 /*!<  TAU1's Channel6 Configuration Register,               Address offset: 0x128 */
  __IO uint32_t T7CFGR;                 /*!<  TAU1's Channel7 Configuration Register,               Address offset: 0x12C */
  __IO uint32_t T0MDR;                  /*!<  TAU1's Channel0 Mode Register,                        Address offset: 0x130 */
  __IO uint32_t T1MDR;                  /*!<  TAU1's Channel1 Mode Register,                        Address offset: 0x134 */
  __IO uint32_t T2MDR;                  /*!<  TAU1's Channel2 Mode Register,                        Address offset: 0x138 */
  __IO uint32_t T3MDR;                  /*!<  TAU1's Channel3 Mode Register,                        Address offset: 0x13C */
  __IO uint32_t T4MDR;                  /*!<  TAU1's Channel4 Mode Register,                        Address offset: 0x140 */
  __IO uint32_t T5MDR;                  /*!<  TAU1's Channel5 Mode Register,                        Address offset: 0x144 */
  __IO uint32_t T6MDR;                  /*!<  TAU1's Channel6 Mode Register,                        Address offset: 0x148 */
  __IO uint32_t T7MDR;                  /*!<  TAU1's Channel7 Mode Register,                        Address offset: 0x14C */
  __IO uint32_t T0ARR;                  /*!<  TAU1 Auto-Reload Register0,                           Address offset: 0x150 */
  __IO uint32_t T1ARR;                  /*!<  TAU1 Auto-Reload Register1,                           Address offset: 0x154 */
  __IO uint32_t T2ARR;                  /*!<  TAU1 Auto-Reload Register2,                           Address offset: 0x158 */
  __IO uint32_t T3ARR;                  /*!<  TAU1 Auto-Reload Register3,                           Address offset: 0x15C */
  __IO uint32_t T4ARR;                  /*!<  TAU1 Auto-Reload Register4,                           Address offset: 0x160 */
  __IO uint32_t T5ARR;                  /*!<  TAU1 Auto-Reload Register5,                           Address offset: 0x164 */
  __IO uint32_t T6ARR;                  /*!<  TAU1 Auto-Reload Register6,                           Address offset: 0x168 */
  __IO uint32_t T7ARR;                  /*!<  TAU1 Auto-Reload Register7,                           Address offset: 0x16C */
  __IO uint32_t T0CCR;                  /*!<  TAU1 Capture/Compare Register0,                       Address offset: 0x170 */
  __IO uint32_t T1CCR;                  /*!<  TAU1 Capture/Compare Register1,                       Address offset: 0x174 */
  __IO uint32_t T2CCR;                  /*!<  TAU1 Capture/Compare Register2,                       Address offset: 0x178 */
  __IO uint32_t T3CCR;                  /*!<  TAU1 Capture/Compare Register3,                       Address offset: 0x17C */
  __IO uint32_t T4CCR;                  /*!<  TAU1 Capture/Compare Register4,                       Address offset: 0x180 */
  __IO uint32_t T5CCR;                  /*!<  TAU1 Capture/Compare Register5,                       Address offset: 0x184 */
  __IO uint32_t T6CCR;                  /*!<  TAU1 Capture/Compare Register6,                       Address offset: 0x188 */
  __IO uint32_t T7CCR;                  /*!<  TAU1 Capture/Compare Register7,                       Address offset: 0x18C */
  __IO uint32_t T0IER;                  /*!<  TAU1 Interrupt Enable Register0,                      Address offset: 0x190 */
  __IO uint32_t T1IER;                  /*!<  TAU1 Interrupt Enable Register1,                      Address offset: 0x194 */
  __IO uint32_t T2IER;                  /*!<  TAU1 Interrupt Enable Register2,                      Address offset: 0x198 */
  __IO uint32_t T3IER;                  /*!<  TAU1 Interrupt Enable Register3,                      Address offset: 0x19C */
  __IO uint32_t T4IER;                  /*!<  TAU1 Interrupt Enable Register4,                      Address offset: 0x1A0 */
  __IO uint32_t T5IER;                  /*!<  TAU1 Interrupt Enable Register5,                      Address offset: 0x1A4 */
  __IO uint32_t T6IER;                  /*!<  TAU1 Interrupt Enable Register6,                      Address offset: 0x1A8 */
  __IO uint32_t T7IER;                  /*!<  TAU1 Interrupt Enable Register7,                      Address offset: 0x1AC */
  __IO uint32_t T0ISR;                  /*!<  TAU1 Interrupt Status Register0,                      Address offset: 0x1B0 */
  __IO uint32_t T1ISR;                  /*!<  TAU1 Interrupt Status Register1,                      Address offset: 0x1B4 */
  __IO uint32_t T2ISR;                  /*!<  TAU1 Interrupt Status Register2,                      Address offset: 0x1B8 */
  __IO uint32_t T3ISR;                  /*!<  TAU1 Interrupt Status Register3,                      Address offset: 0x1BC */
  __IO uint32_t T4ISR;                  /*!<  TAU1 Interrupt Status Register4,                      Address offset: 0x1C0 */
  __IO uint32_t T5ISR;                  /*!<  TAU1 Interrupt Status Register5,                      Address offset: 0x1C4 */
  __IO uint32_t T6ISR;                  /*!<  TAU1 Interrupt Status Register6,                      Address offset: 0x1C8 */
  __IO uint32_t T7ISR;                  /*!<  TAU1 Interrupt Status Register7,                      Address offset: 0x1CC */
  __I  uint32_t T0CNTR;                 /*!<  TAU1 Counter Register0,                               Address offset: 0x1D0 */
  __I  uint32_t T1CNTR;                 /*!<  TAU1 Counter Register1,                               Address offset: 0x1D4 */
  __I  uint32_t T2CNTR;                 /*!<  TAU1 Counter Register2,                               Address offset: 0x1D8 */
  __I  uint32_t T3CNTR;                 /*!<  TAU1 Counter Register3,                               Address offset: 0x1DC */
  __I  uint32_t T4CNTR;                 /*!<  TAU1 Counter Register4,                               Address offset: 0x1E0 */
  __I  uint32_t T5CNTR;                 /*!<  TAU1 Counter Register5,                               Address offset: 0x1E4 */
  __I  uint32_t T6CNTR;                 /*!<  TAU1 Counter Register6,                               Address offset: 0x1E8 */
  __I  uint32_t T7CNTR;                 /*!<  TAU1 Counter Register7,                               Address offset: 0x1EC */
}TAU1_Type;


/* ================================================================================ */
/* ================                     BSTIM32                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  BSTIM32 Control Register1,                            Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  BSTIM32 Control Register2,                            Address offset: 0x04 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  BSTIM 32Interrupt Enable Register,                    Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  BSTIM32 Interrupt Status Register,                    Address offset: 0x10 */
  __O  uint32_t EGR;                    /*!<  BSTIM32 Event Generation Register,                    Address offset: 0x14 */
  __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x18 */
  __IO uint32_t CNT;                    /*!<  BSTIM32 Counter Register,                             Address offset: 0x24 */
  __IO uint32_t PSC;                    /*!<  BSTIM32 Prescaler Register,                           Address offset: 0x28 */
  __IO uint32_t ARR;                    /*!<  BSTIM32 Auto-Reload Register,                         Address offset: 0x2C */
}BSTIM32_Type;


/* ================================================================================ */
/* ================                     BSTIM16                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  BSTIM16 Control Register1,                            Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  BSTIM16 Control Register2,                            Address offset: 0x04 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  BSTIM16 Interrupt Enable Register,                    Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  BSTIM16 Interrupt Status Register,                    Address offset: 0x10 */
  __O  uint32_t EGR;                    /*!<  BSTIM16 Event Generation Register,                    Address offset: 0x14 */
  __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x18 */
  __IO uint32_t CNT;                    /*!<  BSTIM16 Counter Register,                             Address offset: 0x24 */
  __IO uint32_t PSC;                    /*!<  BSTIM16 Prescaler Register,                           Address offset: 0x28 */
  __IO uint32_t ARR;                    /*!<  BSTIM16 Auto-Reload Register,                         Address offset: 0x2C */
}BSTIM16_Type;


