zmzdh/CAN_st_test/Drivers/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fg0xxa.h
/* ================================================================================ */
/* ================                     LPTIM32                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFGR;                   /*!<  LPTIM32 Config Register,                              Address offset: 0x00 */
  __I  uint32_t CNT;                    /*!<  LPTIM32 Counter Register,                             Address offset: 0x04 */
  __IO uint32_t CCSR;                   /*!<  LPTIM32 Capture/Compare Control and Status Register,  Address offset: 0x08 */
  __IO uint32_t ARR;                    /*!<  LPTIM32 Auto-Reload Register,                         Address offset: 0x0C */
  __IO uint32_t IER;                    /*!<  LPTIM32 Interrupt Enable Register,                    Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  LPTIM32 Interrupt Status Register,                    Address offset: 0x14 */
  __IO uint32_t CR;                     /*!<  LPTIM32 Control Register,                             Address offset: 0x18 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t CCR1;                   /*!<  LPTIM32 Capture/Compare Register1,                    Address offset: 0x20 */
  __IO uint32_t CCR2;                   /*!<  LPTIM32 Capture/Compare Register2,                    Address offset: 0x24 */
  __IO uint32_t CCR3;                   /*!<  LPTIM32 Capture/Compare Register3,                    Address offset: 0x28 */
  __IO uint32_t CCR4;                   /*!<  LPTIM32 Capture/Compare Register4,                    Address offset: 0x2C */
}LPTIM32_Type;


/* ================================================================================ */
/* ================                     LPTIM16                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFGR;                   /*!<  LPTIM16 Config Register,                              Address offset: 0x00 */
  __I  uint32_t CNT;                    /*!<  LPTIM16 Counter Register,                             Address offset: 0x04 */
  __IO uint32_t CCSR;                   /*!<  LPTIM16 Capture/Compare Control and Status Register,  Address offset: 0x08 */
  __IO uint32_t ARR;                    /*!<  LPTIM16 Auto-Reload Register,                         Address offset: 0x0C */
  __IO uint32_t IER;                    /*!<  LPTIM16 Interrupt Enable Register,                    Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  LPTIM16 Interrupt Status Register,                    Address offset: 0x14 */
  __IO uint32_t CR;                     /*!<  LPTIM16 Control Register,                             Address offset: 0x18 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t CCR1;                   /*!<  LPTIM16 Capture/Compare Register1,                    Address offset: 0x20 */
  __IO uint32_t CCR2;                   /*!<  LPTIM16 Capture/Compare Register2,                    Address offset: 0x24 */
}LPTIM16_Type;


/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t WER;                    /*!<  RTC Write Enable Register,                            Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  RTC Interrupt Enable Register,                        Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  RTC Interrupt Status Register,                        Address offset: 0x08 */
  __IO uint32_t BCDSEC;                 /*!<  BCD format time second registers,                     Address offset: 0x0C */
  __IO uint32_t BCDMIN;                 /*!<  BCD format time minute registers,                     Address offset: 0x10 */
  __IO uint32_t BCDHOUR;                /*!<  BCD format time hour registers,                       Address offset: 0x14 */
  __IO uint32_t BCDDAY;                 /*!<  BCD format time day registers,                        Address offset: 0x18 */
  __IO uint32_t BCDWEEK;                /*!<  BCD format time week registers,                       Address offset: 0x1C */
  __IO uint32_t BCDMONTH;               /*!<  BCD format time month registers,                      Address offset: 0x20 */
  __IO uint32_t BCDYEAR;                /*!<  BCD format time year registers,                       Address offset: 0x24 */
  __IO uint32_t ALARM;                  /*!<  RTC Alarm Register,                                   Address offset: 0x28 */
  __IO uint32_t TMSEL;                  /*!<  RTC Time Mark Select,                                 Address offset: 0x2C */
  __IO uint32_t ADJUST;                 /*!<  RTC time Adjust Register,                             Address offset: 0x30 */
  __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
  __IO uint32_t SBSCNT;                 /*!<  RTC Sub-Second Counter,                               Address offset: 0x3C */
  __IO uint32_t CR;                     /*!<  RTC Control Register,                                 Address offset: 0x40 */
}RTC_Type;


/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t ISR;                    /*!<  ADC Interrupt and Status Register,                    Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  ADC Interrupt Enable Register,                        Address offset: 0x04 */
  __IO uint32_t CR1;                    /*!<  ADC Control Register1,                                Address offset: 0x08 */
  __IO uint32_t CR2;                    /*!<  ADC Control Register2,                                Address offset: 0x0C */
  __IO uint32_t CALR;                   /*!<  ADC Calibration Register,                             Address offset: 0x10 */
  __IO uint32_t CFGR1;                  /*!<  ADC Config Register1,                                 Address offset: 0x14 */
  __IO uint32_t CFGR2;                  /*!<  ADC Config Register2,                                 Address offset: 0x18 */
  __IO uint32_t SMTR;                   /*!<  ADC Sampling Time Register,                           Address offset: 0x1C */
  __IO uint32_t ECHER;                  /*!<  ADC ExternalChannel Enable Register,                  Address offset: 0x20 */
  __IO uint32_t ICHER;                  /*!<  ADC Internal Channel Control Register,                Address offset: 0x24 */
  __I  uint32_t DR;                     /*!<  ADC Data Register,                                    Address offset: 0x28 */
  __IO uint32_t HLTR;                   /*!<  ADC analog watchdog Threshold Register,               Address offset: 0x2C */
  __IO uint32_t JGCFGR;                 /*!<  ADC Injection Global Config Register,                 Address offset: 0x30 */
  __IO uint32_t JCFGR;                  /*!<  ADC Injection Group Config Register,                  Address offset: 0x34 */
  __IO uint32_t JDR0;                   /*!<  ADC Injection Group Data Register0,                   Address offset: 0x38 */
  __IO uint32_t JDR1;                   /*!<  ADC Injection Group Data Register1,                   Address offset: 0x3C */
  __IO uint32_t JDR2;                   /*!<  ADC Injection Group Data Register2,                   Address offset: 0x40 */
  __IO uint32_t JDR3;                   /*!<  ADC Injection Group Data Register3,                   Address offset: 0x44 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x48 */
  __IO uint32_t RAWR;                   /*!<  ADC Raw Data Register,                                Address offset: 0x4C */
}ADC_Type;


/* ================================================================================ */
/* ================                       DAC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  DAC Control Register,                                 Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  DAC Control Register,                                 Address offset: 0x04 */
  __IO uint32_t CFGR;                   /*!<  DAC Config Register,                                  Address offset: 0x08 */
  __O  uint32_t SWTRGR;                 /*!<  DAC Software Trigger Register,                        Address offset: 0x0C */
  __IO uint32_t DHR;                    /*!<  DAC Data Holding Register,                            Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  DAC Interrupt Status Register,                        Address offset: 0x14 */
  __IO uint32_t IER;                    /*!<  DAC Interrupt Enable Register,                        Address offset: 0x18 */
  __IO uint32_t SHTR;                   /*!<  DAC Sample Hold Time Register,                        Address offset: 0x1C */
}DAC_Type;


/* ================================================================================ */
/* ================                       PGL                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t CFGR0;                  /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t CFGR1;                  /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t CFGR2;                  /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t CFGR3;                  /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t IER;                    /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t ISR;                    /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t LUT0;                   /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t LUT1;                   /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t LUT2;                   /*!<  ,                                                     Address offset: 0x24 */
  __IO uint32_t LUT3;                   /*!<  ,                                                     Address offset: 0x28 */
}PGL_Type;


/* ================================================================================ */
/* ================                      GPIOx                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t INEN;                   /*!<  GPIOx Input Enable Register,                          Address offset: 0x00 */
  __IO uint32_t PUDEN;                  /*!<  GPIOx Pull-Up Pull-Down Enable Register,              Address offset: 0x04 */
  __IO uint32_t ODEN;                   /*!<  GPIOx Open-Drain Enable Register,                     Address offset: 0x08 */
  __IO uint32_t FCR;                    /*!<  GPIOx Function Control Register,                      Address offset: 0x0C */
  __IO uint32_t DO;                     /*!<  GPIOx Data Output Register,                           Address offset: 0x10 */
  __O  uint32_t DSET;                   /*!<  GPIOx Data Set Register,                              Address offset: 0x14 */
  __O  uint32_t DRST;                   /*!<  GPIOx Data Reset Register,                            Address offset: 0x18 */
  __I  uint32_t DIN;                    /*!<  GPIOx Data Input Register,                            Address offset: 0x1C */
  __IO uint32_t DFS;                    /*!<  GPIOx Digital Function Select,                        Address offset: 0x20 */
  __IO uint32_t RSV1[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t DSR;                    /*!<  GPIOx Driver Strength Register,                       Address offset: 0x30 */
  __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
}GPIO_Type;


/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t EXTIEDSA;               /*!<  External Interrupt Edge Select and Enable RegisterA,  Address offset: 0x00 */
  __IO uint32_t EXTIEDSB;               /*!<  External Interrupt Edge Select and Enable RegisterB,  Address offset: 0x04 */
  __IO uint32_t EXTIEDSC;               /*!<  External Interrupt Edge Select and Enable RegisterC,  Address offset: 0x08 */
  __IO uint32_t EXTIEDSD;               /*!<  External Interrupt Edge Select and Enable RegisterD,  Address offset: 0x0C */
  __IO uint32_t EXTIEDSE;               /*!<  External Interrupt Edge Select and Enable RegisterE,  Address offset: 0x10 */
  __IO uint32_t EXTIEDSF;               /*!<  External Interrupt Edge Select and Enable RegisterF,  Address offset: 0x14 */
  __IO uint32_t EXTIEDSG;               /*!<  External Interrupt Edge Select and Enable RegisterG,  Address offset: 0x18 */
  __IO uint32_t EXTIEDSH;               /*!<  External Interrupt Edge Select and Enable RegisterH,  Address offset: 0x1C */
  __IO uint32_t EXTIEDSI;               /*!<  External Interrupt Edge Select and Enable RegisterI,  Address offset: 0x20 */
  __IO uint32_t EXTIDFAB;               /*!<  External Interrupt Digital Filter Register AB,        Address offset: 0x24 */
  __IO uint32_t EXTIDFCD;               /*!<  External Interrupt Digital Filter Register CD,        Address offset: 0x28 */
  __IO uint32_t EXTIDFEF;               /*!<  External Interrupt Digital Filter Register EF,        Address offset: 0x2C */
  __IO uint32_t EXTIDFGH;               /*!<  External Interrupt Digital Filter Register GH,        Address offset: 0x30 */
  __IO uint32_t EXTIDFI;                /*!<  External Interrupt Digital Filter Register I,         Address offset: 0x34 */
  __IO uint32_t EXTIISRAB;              /*!<  External Interrupt and Status Register AB,            Address offset: 0x38 */
  __IO uint32_t EXTIISRCD;              /*!<  External Interrupt and Status Register CD,            Address offset: 0x3C */
  __IO uint32_t EXTIISREF;              /*!<  External Interrupt and Status Register EF,            Address offset: 0x40 */
  __IO uint32_t EXTIISRGH;              /*!<  External Interrupt and Status Register GH,            Address offset: 0x44 */
  __IO uint32_t EXTIISRI;               /*!<  External Interrupt and Status Register I,             Address offset: 0x48 */
  __I  uint32_t EXTDIAB;                /*!<  External Interrupt Data Input Register AB,            Address offset: 0x4C */
  __I  uint32_t EXTDICD;                /*!<  External Interrupt Data Input Register CD,            Address offset: 0x50 */
  __I  uint32_t EXTDIEF;                /*!<  External Interrupt Data Input Register EF,            Address offset: 0x54 */
  __I  uint32_t EXTDIGH;                /*!<  External Interrupt Data Input Register GH,            Address offset: 0x58 */
  __I  uint32_t EXTDII;                 /*!<  External Interrupt Data Input Register I,             Address offset: 0x5C */
  __IO uint32_t RSV1[8];                /*!<  RESERVED REGISTER,                                    Address offset: 0x60 */
  __IO uint32_t FOUTSEL;                /*!<  Frequency Output Select Register,                     Address offset: 0x80 */
  __IO uint32_t RSV2[22];               /*!<  RESERVED REGISTER,                                    Address offset: 0x84 */
  __IO uint32_t PINWKEN;                /*!<  Wakeup Enable Register,                               Address offset: 0xDC */
}GPIO_COMMON_Type;


/* ================================================================================ */
/* ================                       SFU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x00 */
  __IO uint32_t MAPCR;                  /*!<  Memory Access Protection Control Register,            Address offset: 0x08 */
  __IO uint32_t MAPSR;                  /*!<  Memory Access Protection Control Register,            Address offset: 0x0C */
}SFU_Type;


/* ================================================================================ */
/* ================                       DBG                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  MCU Debug Configuration Register,                     Address offset: 0x04 */
  __IO uint32_t HDFR;                   /*!<  Hradfault Query Register,                             Address offset: 0x08 */
}DBG_Type;



/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif


/* ================================================================================ */
/* ================              CPU memory map                    ================ */
/* ================================================================================ */


/* Peripheral and SRAM base address */

