zmzdh/CAN_st_test/Drivers/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fg0xxa.h
#define FLASH_BASE            ((     uint32_t)0x00000000)
#define SRAM_BASE             ((     uint32_t)0x20000000)
#define PERIPH_BASE           ((     uint32_t)0x40000000)


/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

/* Peripheral memory map */

#define FLS_BASE                        (PERIPH_BASE        +0x00001000)
#define PMU_BASE                        (PERIPH_BASE        +0x00002000)
#define SCU_BASE                        (PERIPH_BASE        +0x00000000)
#define RMU_BASE                        (PERIPH_BASE        +0x00002800)
#define IWDT_BASE                       (PERIPH_BASE        +0x00011400)
#define WWDT_BASE                       (PERIPH_BASE        +0x00011800)
#define CMU_BASE                        (PERIPH_BASE        +0x00002400)
#define CLM0_BASE                       (PERIPH_BASE        +0x0001B800)
#define CLM1_BASE                       (PERIPH_BASE        +0x0001BC00)
#define SVD_BASE                        (PERIPH_BASE        +0x00012800)
#define AES_BASE                        (PERIPH_BASE        +0x00013800)
#define RNG_BASE                        (PERIPH_BASE        +0x00013C00)
#define COMP1_BASE                      (PERIPH_BASE        +0x00015400)
#define COMP2_BASE                      (PERIPH_BASE        +0x00015404)
#define COMP3_BASE                      (PERIPH_BASE        +0x00015408)
#define COMP4_BASE                      (PERIPH_BASE        +0x0001540C)
#define COMP_COMMON_BASE                (PERIPH_BASE        +0x00015410)
#define HDIV_BASE                       (PERIPH_BASE        +0x00019400)
#define I2CSMB0_BASE                    (PERIPH_BASE        +0x0001A000)
#define I2CSMB1_BASE                    (PERIPH_BASE        +0x0001A400)
#define I2C0_BASE                       (PERIPH_BASE        +0x00012400)
#define I2C1_BASE                       (PERIPH_BASE        +0x00019C00)
#define UART_COMMON_BASE                (PERIPH_BASE        +0x00017C00)
#define UART0_BASE                      (PERIPH_BASE        +0x00016800)
#define UART1_BASE                      (PERIPH_BASE        +0x00017000)
#define UART2_BASE                      (PERIPH_BASE        +0x00017400)
#define UART3_BASE                      (PERIPH_BASE        +0x00017800)
#define UART4_BASE                      (PERIPH_BASE        +0x00011C00)
#define UART5_BASE                      (PERIPH_BASE        +0x00012000)
#define LPUART0_BASE                    (PERIPH_BASE        +0x00014000)
#define LPUART1_BASE                    (PERIPH_BASE        +0x00014400)
#define LPUART2_BASE                    (PERIPH_BASE        +0x00015000)
#define SPI0_BASE                       (PERIPH_BASE        +0x00010400)
#define SPI1_BASE                       (PERIPH_BASE        +0x00010800)
#define SPI2_BASE                       (PERIPH_BASE        +0x00014800)
#define SPI3_BASE                       (PERIPH_BASE        +0x0001A800)
#define CAN_BASE                        (PERIPH_BASE        +0x00028000)
#define CANFD0_BASE                     (PERIPH_BASE        +0x00020000)
#define CANFD0_RX_FIFO_BASE             (PERIPH_BASE        +0x00020520)
#define CANFD0_COMMON_FIFO_BASE         (PERIPH_BASE        +0x000205B8)
#define CANFD0_TX_MESSAGE_BASE          (PERIPH_BASE        +0x00020604)
#define CANFD0_TX_HISTORY_LIST_BASE     (PERIPH_BASE        +0x00020740)
#define CANFD0_RX_MESSAGE0_BASE         (PERIPH_BASE        +0x00020920)
#define CANFD0_RX_MESSAGE1_BASE         (PERIPH_BASE        +0x00020D20)
#define CANFD0_RX_MESSAGE2_BASE         (PERIPH_BASE        +0x00021120)
#define CANFD0_RX_MESSAGE3_BASE         (PERIPH_BASE        +0x00021520)
#define CANFD1_BASE                     (PERIPH_BASE        +0x00024000)
#define CANFD1_RX_FIFO_BASE             (PERIPH_BASE        +0x00024520)
#define CANFD1_COMMON_FIFO_BASE         (PERIPH_BASE        +0x000245B8)
#define CANFD1_TX_MESSAGE_BASE          (PERIPH_BASE        +0x00024604)
#define CANFD1_TX_HISTORY_LIST_BASE     (PERIPH_BASE        +0x00024740)
#define CANFD1_RX_MESSAGE0_BASE         (PERIPH_BASE        +0x00024920)
#define CANFD1_RX_MESSAGE1_BASE         (PERIPH_BASE        +0x00024D20)
#define CANFD1_RX_MESSAGE2_BASE         (PERIPH_BASE        +0x00025120)
#define CANFD1_RX_MESSAGE3_BASE         (PERIPH_BASE        +0x00025520)
#define SENT0_BASE                      (PERIPH_BASE        +0x0001B000)
#define SENT1_BASE                      (PERIPH_BASE        +0x0001B400)
#define DMA_BASE                        (PERIPH_BASE        +0x00000400)
#define CRC_BASE                        (PERIPH_BASE        +0x00010000)
#define ATIM_BASE                       (PERIPH_BASE        +0x00013000)
#define GPTIM0_BASE                     (PERIPH_BASE        +0x00014C00)
#define GPTIM1_BASE                     (PERIPH_BASE        +0x00016400)
#define GPTIM2_BASE                     (PERIPH_BASE        +0x00018000)
#define TAU_COMMON_BASE                 (PERIPH_BASE        +0x00015800)
#define TAU0_BASE                       (PERIPH_BASE        +0x00015810)
#define TAU1_BASE                       (PERIPH_BASE        +0x00015910)
#define BSTIM32_BASE                    (PERIPH_BASE        +0x00016000)
#define BSTIM16_BASE                    (PERIPH_BASE        +0x00018400)
#define LPTIM32_BASE                    (PERIPH_BASE        +0x00013400)
#define LPTIM16_BASE                    (PERIPH_BASE        +0x00018800)
#define RTC_BASE                        (PERIPH_BASE        +0x00011000)
#define ADC_BASE                        (PERIPH_BASE        +0x00015C00)
#define DAC_BASE                        (PERIPH_BASE        +0x00019000)
#define PGL_BASE                        (PERIPH_BASE        +0x00016C00)
#define GPIOA_BASE                      (PERIPH_BASE        +0x00000C00)
#define GPIOB_BASE                      (PERIPH_BASE        +0x00000C40)
#define GPIOC_BASE                      (PERIPH_BASE        +0x00000C80)
#define GPIOD_BASE                      (PERIPH_BASE        +0x00000CC0)
#define GPIOE_BASE                      (PERIPH_BASE        +0x00000D00)
#define GPIOF_BASE                      (PERIPH_BASE        +0x00000D40)
#define GPIOG_BASE                      (PERIPH_BASE        +0x00000D80)
#define GPIOH_BASE                      (PERIPH_BASE        +0x00000DC0)
#define GPIOI_BASE                      (PERIPH_BASE        +0x00000E00)
#define GPIO_COMMON_BASE                (PERIPH_BASE        +0x00000E40)
#define SFU_BASE                        (PERIPH_BASE        +0x00001C00)
#define DBG_BASE                        (PERIPH_BASE        +0x00000000)

/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define FLASH                           ((FLASH_Type        *) FLS_BASE         )
#define PMU                             ((PMU_Type          *) PMU_BASE         )
#define SCU                             ((SCU_Type          *) SCU_BASE         )
#define RMU                             ((RMU_Type          *) RMU_BASE         )
#define IWDT                            ((IWDT_Type         *) IWDT_BASE        )
#define WWDT                            ((WWDT_Type         *) WWDT_BASE        )
#define CMU                             ((CMU_Type          *) CMU_BASE         )
#define CLM0                            ((CLM_Type          *) CLM0_BASE        )
#define CLM1                            ((CLM_Type          *) CLM1_BASE        )
#define SVD                             ((SVD_Type          *) SVD_BASE         )
#define AES                             ((AES_Type          *) AES_BASE         )
#define RNG                             ((RNG_Type          *) RNG_BASE         )
#define COMP1                           ((COMP_Type         *) COMP1_BASE       )
#define COMP2                           ((COMP_Type         *) COMP2_BASE       )
#define COMP3                           ((COMP_Type         *) COMP3_BASE       )
#define COMP4                           ((COMP_Type         *) COMP4_BASE       )
#define COMP                            ((COMP_COMMON_Type  *) COMP_COMMON_BASE )
#define HDIV                            ((HDIV_Type         *) HDIV_BASE        )
#define I2CSMB0                         ((I2CSMB_Type       *) I2CSMB0_BASE     )
#define I2CSMB1                         ((I2CSMB_Type       *) I2CSMB1_BASE     )
#define I2C0                            ((I2C_Type          *) I2C0_BASE        )
#define I2C1                            ((I2C_Type          *) I2C1_BASE        )
#define UART                            ((UART_COMMON_Type  *) UART_COMMON_BASE )
#define UART0                           ((UART_Type         *) UART0_BASE       )
#define UART1                           ((UART_Type         *) UART1_BASE       )
#define UART2                           ((UART_Type         *) UART2_BASE       )
#define UART3                           ((UART_Type         *) UART3_BASE       )
#define UART4                           ((UART_Type         *) UART4_BASE       )
#define UART5                           ((UART_Type         *) UART5_BASE       )
#define LPUART0                         ((LPUART_Type       *) LPUART0_BASE     )
#define LPUART1                         ((LPUART_Type       *) LPUART1_BASE     )
#define LPUART2                         ((LPUART_Type       *) LPUART2_BASE     )
#define SPI0                            ((SPI_Type          *) SPI0_BASE        )
#define SPI1                            ((SPI_Type          *) SPI1_BASE        )
#define SPI2                            ((SPI_Type          *) SPI2_BASE        )
#define SPI3                            ((SPI_Type          *) SPI3_BASE        )
#define CAN                             ((CAN_Type          *) CAN_BASE         )
#define CANFD0                          ((CANFD_COMMON_Type          *) CANFD0_BASE                 )
#define CANFD0_RX_FIFO                  ((CANFD_RX_FIFO_Type         *) CANFD0_RX_FIFO_BASE         )
#define CANFD0_COMMON_FIFO              ((CANFD_COMMON_FIFO_Type     *) CANFD0_COMMON_FIFO_BASE     )
#define CANFD0_TX_MESSAGE               ((CANFD_TX_MESSAGE_Type      *) CANFD0_TX_MESSAGE_BASE      )
#define CANFD0_TX_HISTORY_LIST          ((CANFD_TX_HISTORY_LIST_Type *) CANFD0_TX_HISTORY_LIST_BASE )
#define CANFD0_RX_MESSAGE0              ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE0_BASE     )
#define CANFD0_RX_MESSAGE1              ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE1_BASE     )
#define CANFD0_RX_MESSAGE2              ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE2_BASE     )
#define CANFD0_RX_MESSAGE3              ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE3_BASE     )
#define CANFD1                          ((CANFD_COMMON_Type          *) CANFD1_BASE                 )
#define CANFD1_RX_FIFO                  ((CANFD_RX_FIFO_Type         *) CANFD1_RX_FIFO_BASE         )
#define CANFD1_COMMON_FIFO              ((CANFD_COMMON_FIFO_Type     *) CANFD1_COMMON_FIFO_BASE     )
#define CANFD1_TX_MESSAGE               ((CANFD_TX_MESSAGE_Type      *) CANFD1_TX_MESSAGE_BASE      )
#define CANFD1_TX_HISTORY_LIST          ((CANFD_TX_HISTORY_LIST_Type *) CANFD1_TX_HISTORY_LIST_BASE )
#define CANFD1_RX_MESSAGE0              ((CANFD_RX_MESSAGE_Type      *) CANFD1_RX_MESSAGE0_BASE     )
#define CANFD1_RX_MESSAGE1              ((CANFD_RX_MESSAGE_Type      *) CANFD1_RX_MESSAGE1_BASE     )
#define CANFD1_RX_MESSAGE2              ((CANFD_RX_MESSAGE_Type      *) CANFD1_RX_MESSAGE2_BASE     )
#define CANFD1_RX_MESSAGE3              ((CANFD_RX_MESSAGE_Type      *) CANFD1_RX_MESSAGE3_BASE     )
#define SENT0                           ((SENT_Type         *) SENT0_BASE       )
#define SENT1                           ((SENT_Type         *) SENT1_BASE       )
#define DMA                             ((DMA_Type          *) DMA_BASE         )
#define CRC                             ((CRC_Type          *) CRC_BASE         )
#define ATIM                            ((ATIM_Type         *) ATIM_BASE        )
#define GPTIM0                          ((GPTIM_Type        *) GPTIM0_BASE      )
#define GPTIM1                          ((GPTIM_Type        *) GPTIM1_BASE      )
#define GPTIM2                          ((GPTIM_Type        *) GPTIM2_BASE      )
#define TAU                             ((TAU_COMMON_Type   *) TAU_COMMON_BASE  )
#define TAU0                            ((TAU0_Type         *) TAU0_BASE        )
#define TAU1                            ((TAU1_Type         *) TAU1_BASE        )
#define BSTIM32                         ((BSTIM32_Type      *) BSTIM32_BASE     )
#define BSTIM16                         ((BSTIM16_Type      *) BSTIM16_BASE     )
#define LPTIM32                         ((LPTIM32_Type      *) LPTIM32_BASE     )
#define LPTIM16                         ((LPTIM16_Type      *) LPTIM16_BASE     )
#define RTC                             ((RTC_Type          *) RTC_BASE         )
#define ADC                             ((ADC_Type          *) ADC_BASE         )
#define DAC                             ((DAC_Type          *) DAC_BASE         )
#define PGL                             ((PGL_Type          *) PGL_BASE         )
#define GPIOA                           ((GPIO_Type         *) GPIOA_BASE       )
#define GPIOB                           ((GPIO_Type         *) GPIOB_BASE       )
#define GPIOC                           ((GPIO_Type         *) GPIOC_BASE       )
#define GPIOD                           ((GPIO_Type         *) GPIOD_BASE       )
#define GPIOE                           ((GPIO_Type         *) GPIOE_BASE       )
#define GPIOF                           ((GPIO_Type         *) GPIOF_BASE       )
#define GPIOG                           ((GPIO_Type         *) GPIOG_BASE       )
#define GPIOH                           ((GPIO_Type         *) GPIOH_BASE       )
#define GPIOI                           ((GPIO_Type         *) GPIOI_BASE       )
#define GPIO                            ((GPIO_COMMON_Type  *) GPIO_COMMON_BASE )
#define SFU                             ((SFU_Type          *) SFU_BASE         )
#define DBG                             ((DBG_Type          *) DBG_BASE         )

/* ================================================================================ */
/* ================             Peripheral include                 ================ */
/* ================================================================================ */

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33FG0XXA */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif

#endif  /* FM33FG0XXA_H */

